; ModuleID = 'AP_AHRS_Backend.cpp.7.o'
source_filename = "../../libraries/AP_AHRS/AP_AHRS_Backend.cpp"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%"class.AP_HAL::HAL" = type { i32 (...)**, %"class.AP_HAL::I2CDeviceManager"*, %"class.AP_HAL::SPIDeviceManager"*, %"class.AP_HAL::WSPIDeviceManager"*, %"class.AP_HAL::AnalogIn"*, %"class.AP_HAL::Storage"*, %"class.AP_HAL::UARTDriver"*, %"class.AP_HAL::GPIO"*, %"class.AP_HAL::RCInput"*, %"class.AP_HAL::RCOutput"*, %"class.AP_HAL::Scheduler"*, %"class.AP_HAL::Util"*, %"class.AP_HAL::OpticalFlow"*, %"class.AP_HAL::Flash"*, %"class.AP_HAL::DSP"*, [2 x %"class.AP_HAL::CANIface"*], [10 x %"class.AP_HAL::UARTDriver"*] }
%"class.AP_HAL::I2CDeviceManager" = type opaque
%"class.AP_HAL::SPIDeviceManager" = type { i32 (...)** }
%"class.AP_HAL::WSPIDeviceManager" = type { i32 (...)** }
%"class.AP_HAL::AnalogIn" = type { i32 (...)** }
%"class.AP_HAL::Storage" = type { i32 (...)** }
%"class.AP_HAL::UARTDriver" = type <{ %"class.AP_HAL::BetterStream", i32, i32, i16, [2 x i8] }>
%"class.AP_HAL::BetterStream" = type { i32 (...)** }
%"class.AP_HAL::GPIO" = type { i32 (...)** }
%"class.AP_HAL::RCInput" = type { i32 (...)** }
%"class.AP_HAL::RCOutput" = type <{ i32 (...)**, i8, i8, i16, i16, [2 x i8] }>
%"class.AP_HAL::Scheduler" = type <{ i32 (...)**, i16, [2 x i8], void ()*, i8, [3 x i8] }>

!42 = !DIFile(filename: "../../libraries/AP_NavEKF3/AP_NavEKF3.h", directory: "/workdisk/akul/fire/fin/ardupilot/build/Pixhawk6C")
!43 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "NavEKF3", file: !42, line: 31, size: 3968, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !44, identifier: "_ZTS7NavEKF3")
!44 = !{!45, !520, !521, !522, !523, !526, !527, !528, !561, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !706, !707, !708, !709, !710, !711, !712, !713, !714, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !767, !768, !769, !776, !1008, !1015, !1016, !1020, !1022, !1024, !1025, !1027, !1674, !1675, !1809, !1813, !1818, !1822, !1826, !1829, !1830, !1833, !1836, !1841, !1842, !1845, !1848, !1851, !1854, !1858, !1861, !1864, !1865, !1866, !1867, !1868, !1871, !1872, !1873, !1874, !1875, !1878, !1882, !1883, !1886, !1889, !1890, !1891, !1896, !2137, !2140, !2143, !2146, !2149, !2150, !2155, !2158, !2161, !2164, !2167, !2172, !2175, !2178, !2181, !2211, !2217, !2218, !2221, !2224, !2227, !2228, !2231, !2232, !2233, !2234, !2235, !2238, !2239, !2240, !2241, !2242, !2245, !2246, !2247, !2248, !2255, !2258, !2259, !2260, !2263, !2264, !2265}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "var_info", scope: !43, file: !42, line: 40, baseType: !46, flags: DIFlagPublic | DIFlagStaticMember)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, elements: !518)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "GroupInfo", scope: !49, file: !32, line: 197, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param9GroupInfoE")
!49 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_Param", file: !32, line: 191, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !50, identifier: "_ZTS8AP_Param")
!50 = !{!51, !53, !59, !64, !65, !67, !68, !69, !70, !71, !144, !145, !146, !147, !148, !149, !153, !176, !177, !179, !183, !186, !187, !188, !189, !190, !191, !192, !193, !196, !197, !200, !201, !205, !208, !209, !212, !221, !233, !238, !241, !247, !248, !252, !253, !254, !258, !261, !265, !268, !269, !272, !275, !278, !279, !282, !285, !286, !289, !290, !293, !296, !299, !302, !303, !306, !307, !313, !316, !319, !322, !325, !328, !331, !334, !335, !339, !342, !345, !346, !349, !352, !353, !356, !357, !360, !361, !362, !363, !366, !369, !372, !375, !378, !384, !387, !390, !393, !396, !401, !405, !408, !411, !418, !421, !424, !434, !437, !440, !443, !444, !449, !453, !456, !460, !463, !469, !473, !476, !481, !484, !490, !493, !496, !497, !500, !503, !504, !507, !508, !511, !514, !515}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_singleton", scope: !49, file: !32, line: 592, baseType: !52, flags: DIFlagStaticMember)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "sentinal_offset", scope: !49, file: !32, line: 606, baseType: !54, flags: DIFlagStaticMember)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !55, line: 36, baseType: !56)
!55 = !DIFile(filename: "/opt/gcc-arm-none-eabi-10-2020-q4-major/bin/../arm-none-eabi/include/sys/_stdint.h", directory: "")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !57, line: 57, baseType: !58)
!57 = !DIFile(filename: "/opt/gcc-arm-none-eabi-10-2020-q4-major/bin/../arm-none-eabi/include/machine/_default_types.h", directory: "")
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_group_level_shift", scope: !49, file: !32, line: 630, baseType: !60, flags: DIFlagStaticMember, extraData: i8 6)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !55, line: 24, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !57, line: 43, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_group_bits", scope: !49, file: !32, line: 631, baseType: !60, flags: DIFlagStaticMember, extraData: i8 18)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_sentinal_key", scope: !49, file: !32, line: 633, baseType: !66, flags: DIFlagStaticMember, extraData: i16 511)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sentinal_type", scope: !49, file: !32, line: 634, baseType: !60, flags: DIFlagStaticMember, extraData: i8 31)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sentinal_group", scope: !49, file: !32, line: 635, baseType: !60, flags: DIFlagStaticMember, extraData: i8 -1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_frame_type_flags", scope: !49, file: !32, line: 637, baseType: !54, flags: DIFlagStaticMember)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "done_all_default_params", scope: !49, file: !32, line: 642, baseType: !8, flags: DIFlagStaticMember)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_storage", scope: !49, file: !32, line: 771, baseType: !72, flags: DIFlagStaticMember)
!72 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "StorageAccess", file: !4, line: 91, size: 96, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !73, identifier: "_ZTS13StorageAccess")
!73 = !{!74, !76, !77, !80, !84, !89, !97, !102, !105, !106, !109, !114, !118, !121, !122, !125, !128, !131, !135, !141}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !4, line: 123, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !72, file: !4, line: 124, baseType: !54, size: 16, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !72, file: !4, line: 140, baseType: !78, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileStorage", scope: !72, file: !4, line: 131, size: 448, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN13StorageAccess11FileStorageE")
!80 = !DISubprogram(name: "StorageAccess", scope: !72, file: !4, line: 94, type: !81, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !83, !3}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!84 = !DISubprogram(name: "size", linkageName: "_ZNK13StorageAccess4sizeEv", scope: !72, file: !4, line: 97, type: !85, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{!54, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!89 = !DISubprogram(name: "read_block", linkageName: "_ZNK13StorageAccess10read_blockEPvtj", scope: !72, file: !4, line: 100, type: !90, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubroutineType(types: !91)
!91 = !{!8, !87, !92, !54, !93}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 40, baseType: !95)
!94 = !DIFile(filename: "/opt/gcc-arm-none-eabi-10-2020-q4-major/bin/../arm-none-eabi/include/strings.h", directory: "")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !96, line: 131, baseType: !21)
!96 = !DIFile(filename: "/opt/gcc-arm-none-eabi-10-2020-q4-major/bin/../arm-none-eabi/include/sys/_types.h", directory: "")
!97 = !DISubprogram(name: "write_block", linkageName: "_ZNK13StorageAccess11write_blockEtPKvj", scope: !72, file: !4, line: 101, type: !98, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!98 = !DISubroutineType(types: !99)
!99 = !{!8, !87, !54, !100, !93}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!102 = !DISubprogram(name: "read_byte", linkageName: "_ZNK13StorageAccess9read_byteEt", scope: !72, file: !4, line: 104, type: !103, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!103 = !DISubroutineType(types: !104)
!104 = !{!61, !87, !54}
!105 = !DISubprogram(name: "read_uint8", linkageName: "_ZNK13StorageAccess10read_uint8Et", scope: !72, file: !4, line: 105, type: !103, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!106 = !DISubprogram(name: "read_uint16", linkageName: "_ZNK13StorageAccess11read_uint16Et", scope: !72, file: !4, line: 106, type: !107, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!107 = !DISubroutineType(types: !108)
!108 = !{!54, !87, !54}
!109 = !DISubprogram(name: "read_uint32", linkageName: "_ZNK13StorageAccess11read_uint32Et", scope: !72, file: !4, line: 107, type: !110, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !87, !54}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !55, line: 48, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !57, line: 79, baseType: !21)
!114 = !DISubprogram(name: "read_float", linkageName: "_ZNK13StorageAccess10read_floatEt", scope: !72, file: !4, line: 108, type: !115, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!115 = !DISubroutineType(types: !116)
!116 = !{!117, !87, !54}
!117 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!118 = !DISubprogram(name: "write_byte", linkageName: "_ZNK13StorageAccess10write_byteEth", scope: !72, file: !4, line: 110, type: !119, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !87, !54, !61}
!121 = !DISubprogram(name: "write_uint8", linkageName: "_ZNK13StorageAccess11write_uint8Eth", scope: !72, file: !4, line: 111, type: !119, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!122 = !DISubprogram(name: "write_uint16", linkageName: "_ZNK13StorageAccess12write_uint16Ett", scope: !72, file: !4, line: 112, type: !123, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !87, !54, !54}
!125 = !DISubprogram(name: "write_uint32", linkageName: "_ZNK13StorageAccess12write_uint32Etj", scope: !72, file: !4, line: 113, type: !126, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !87, !54, !112}
!128 = !DISubprogram(name: "write_float", linkageName: "_ZNK13StorageAccess11write_floatEtf", scope: !72, file: !4, line: 114, type: !129, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !87, !54, !117}
!131 = !DISubprogram(name: "copy_area", linkageName: "_ZNK13StorageAccess9copy_areaERKS_", scope: !72, file: !4, line: 117, type: !132, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!132 = !DISubroutineType(types: !133)
!133 = !{!8, !87, !134}
!134 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !88, size: 32)
!135 = !DISubprogram(name: "attach_file", linkageName: "_ZN13StorageAccess11attach_fileEPKct", scope: !72, file: !4, line: 120, type: !136, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!136 = !DISubroutineType(types: !137)
!137 = !{!8, !83, !138, !54}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!141 = !DISubprogram(name: "flush_file", linkageName: "_ZN13StorageAccess10flush_fileEv", scope: !72, file: !4, line: 142, type: !142, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !83}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_storage_bak", scope: !49, file: !32, line: 772, baseType: !72, flags: DIFlagStaticMember)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_num_vars", scope: !49, file: !32, line: 773, baseType: !54, flags: DIFlagStaticMember)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_parameter_count", scope: !49, file: !32, line: 774, baseType: !54, flags: DIFlagStaticMember)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_count_marker", scope: !49, file: !32, line: 775, baseType: !54, flags: DIFlagStaticMember)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_count_marker_done", scope: !49, file: !32, line: 776, baseType: !54, flags: DIFlagStaticMember)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_count_sem", scope: !49, file: !32, line: 777, baseType: !150, flags: DIFlagStaticMember)
!150 = !DICompositeType(tag: DW_TAG_class_type, name: "Semaphore", scope: !152, file: !151, line: 25, size: 192, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7ChibiOS9SemaphoreE")
!151 = !DIFile(filename: "../../libraries/AP_HAL_ChibiOS/Semaphores.h", directory: "/workdisk/akul/fire/fin/ardupilot/build/Pixhawk6C")
!152 = !DINamespace(name: "ChibiOS", scope: null)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_var_info", scope: !49, file: !32, line: 778, baseType: !154, flags: DIFlagStaticMember)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Info", scope: !49, file: !32, line: 210, size: 160, flags: DIFlagTypePassByValue, elements: !157, identifier: "_ZTSN8AP_Param4InfoE")
!157 = !{!158, !159, !160, !173, !174, !175}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !32, line: 211, baseType: !138, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !156, file: !32, line: 212, baseType: !100, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !156, file: !32, line: 213, baseType: !161, size: 32, offset: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !156, file: !32, line: 213, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !162, identifier: "_ZTSN8AP_Param4InfoUt_E")
!162 = !{!163, !165, !167, !169}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "group_info", scope: !161, file: !32, line: 214, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "group_info_ptr", scope: !161, file: !32, line: 215, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "def_value", scope: !161, file: !32, line: 216, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "def_value_offset", scope: !161, file: !32, line: 217, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !171, line: 35, baseType: !172)
!171 = !DIFile(filename: "dev2/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/workdisk/akul/fire")
!172 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !156, file: !32, line: 219, baseType: !54, size: 16, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !156, file: !32, line: 220, baseType: !54, size: 16, offset: 112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !32, line: 221, baseType: !61, size: 8, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_num_vars_base", scope: !49, file: !32, line: 782, baseType: !54, flags: DIFlagStaticMember)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_var_info_dynamic", scope: !49, file: !32, line: 783, baseType: !178, flags: DIFlagStaticMember)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_dynamic_table_sizes", scope: !49, file: !32, line: 787, baseType: !180, flags: DIFlagStaticMember)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 80, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 10)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "param_overrides", scope: !49, file: !32, line: 803, baseType: !184, flags: DIFlagStaticMember)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "param_override", scope: !49, file: !32, line: 798, size: 96, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param14param_overrideE")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "num_param_overrides", scope: !49, file: !32, line: 804, baseType: !54, flags: DIFlagStaticMember)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "param_overrides_len", scope: !49, file: !32, line: 805, baseType: !54, flags: DIFlagStaticMember)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "num_read_only", scope: !49, file: !32, line: 806, baseType: !54, flags: DIFlagStaticMember)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "k_EEPROM_magic0", scope: !49, file: !32, line: 809, baseType: !60, flags: DIFlagStaticMember, extraData: i8 80)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "k_EEPROM_magic1", scope: !49, file: !32, line: 810, baseType: !60, flags: DIFlagStaticMember, extraData: i8 65)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "k_EEPROM_revision", scope: !49, file: !32, line: 811, baseType: !60, flags: DIFlagStaticMember, extraData: i8 6)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_hide_disabled_groups", scope: !49, file: !32, line: 813, baseType: !8, flags: DIFlagStaticMember)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "save_queue", scope: !49, file: !32, line: 821, baseType: !194, flags: DIFlagStaticMember)
!194 = !DICompositeType(tag: DW_TAG_class_type, name: "ObjectBuffer_TS<AP_Param::param_save>", file: !195, line: 284, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS15ObjectBuffer_TSIN8AP_Param10param_saveEE")
!195 = !DIFile(filename: "../../libraries/AP_HAL/utility/RingBuffer.h", directory: "/workdisk/akul/fire/fin/ardupilot/build/Pixhawk6C")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "registered_save_handler", scope: !49, file: !32, line: 822, baseType: !8, flags: DIFlagStaticMember)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "default_list", scope: !49, file: !32, line: 833, baseType: !198, flags: DIFlagStaticMember)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "defaults_list", scope: !49, file: !32, line: 828, size: 96, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param13defaults_listE")
!200 = !DISubprogram(name: "setup", linkageName: "_ZN8AP_Param5setupEv", scope: !49, file: !32, line: 239, type: !19, scopeLine: 239, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!201 = !DISubprogram(name: "AP_Param", scope: !49, file: !32, line: 242, type: !202, scopeLine: 242, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !204, !154}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!205 = !DISubprogram(name: "AP_Param", scope: !49, file: !32, line: 258, type: !206, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !204}
!208 = !DISubprogram(name: "initialised", linkageName: "_ZN8AP_Param11initialisedEv", scope: !49, file: !32, line: 277, type: !19, scopeLine: 277, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!209 = !DISubprogram(name: "group_id", linkageName: "_ZN8AP_Param8group_idEPKNS_9GroupInfoEjhh", scope: !49, file: !32, line: 285, type: !210, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!210 = !DISubroutineType(types: !211)
!211 = !{!112, !164, !112, !61, !61}
!212 = !DISubprogram(name: "copy_name_info", linkageName: "_ZNK8AP_Param14copy_name_infoEPKNS_4InfoEPKNS_9GroupInfoERKNS_12GroupNestingEhPcjb", scope: !49, file: !32, line: 299, type: !213, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215, !154, !164, !217, !61, !220, !93, !8}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!217 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "GroupNesting", scope: !49, file: !32, line: 270, size: 96, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param12GroupNestingE")
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!221 = !DISubprogram(name: "copy_name_token", linkageName: "_ZNK8AP_Param15copy_name_tokenERKNS_10ParamTokenEPcjb", scope: !49, file: !32, line: 308, type: !222, scopeLine: 308, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !215, !224, !220, !93, !8}
!224 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParamToken", scope: !49, file: !32, line: 266, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !49, file: !32, line: 261, size: 32, flags: DIFlagTypePassByValue, elements: !228, identifier: "_ZTSN8AP_Param10ParamTokenE")
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !227, file: !32, line: 262, baseType: !112, size: 9, flags: DIFlagBitField, extraData: i64 0)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !227, file: !32, line: 263, baseType: !112, size: 4, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "group_element", scope: !227, file: !32, line: 264, baseType: !112, size: 18, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "last_disabled", scope: !227, file: !32, line: 265, baseType: !112, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!233 = !DISubprogram(name: "find", linkageName: "_ZN8AP_Param4findEPKcP11ap_var_typePt", scope: !49, file: !32, line: 319, type: !234, scopeLine: 319, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{!52, !138, !236, !237}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!238 = !DISubprogram(name: "set_default_by_name", linkageName: "_ZN8AP_Param19set_default_by_nameEPKcf", scope: !49, file: !32, line: 326, type: !239, scopeLine: 326, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!239 = !DISubroutineType(types: !240)
!240 = !{!8, !138, !117}
!241 = !DISubprogram(name: "set_defaults_from_table", linkageName: "_ZN8AP_Param23set_defaults_from_tableEPKNS_21defaults_table_structEh", scope: !49, file: !32, line: 332, type: !242, scopeLine: 332, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !244, !61}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "defaults_table_struct", scope: !49, file: !32, line: 231, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param21defaults_table_structE")
!247 = !DISubprogram(name: "set_by_name", linkageName: "_ZN8AP_Param11set_by_nameEPKcf", scope: !49, file: !32, line: 339, type: !239, scopeLine: 339, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!248 = !DISubprogram(name: "get", linkageName: "_ZN8AP_Param3getEPKcRf", scope: !49, file: !32, line: 346, type: !249, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!249 = !DISubroutineType(types: !250)
!250 = !{!8, !138, !251}
!251 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !117, size: 32)
!252 = !DISubprogram(name: "set_and_save_by_name", linkageName: "_ZN8AP_Param20set_and_save_by_nameEPKcf", scope: !49, file: !32, line: 353, type: !239, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!253 = !DISubprogram(name: "set_and_save_by_name_ifchanged", linkageName: "_ZN8AP_Param30set_and_save_by_name_ifchangedEPKcf", scope: !49, file: !32, line: 354, type: !239, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!254 = !DISubprogram(name: "find_by_index", linkageName: "_ZN8AP_Param13find_by_indexEtP11ap_var_typePNS_10ParamTokenE", scope: !49, file: !32, line: 363, type: !255, scopeLine: 363, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!255 = !DISubroutineType(types: !256)
!256 = !{!52, !54, !236, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!258 = !DISubprogram(name: "find_by_name", linkageName: "_ZN8AP_Param12find_by_nameEPKcP11ap_var_typePNS_10ParamTokenE", scope: !49, file: !32, line: 366, type: !259, scopeLine: 366, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!259 = !DISubroutineType(types: !260)
!260 = !{!52, !138, !236, !257}
!261 = !DISubprogram(name: "find_key_by_pointer_group", linkageName: "_ZN8AP_Param25find_key_by_pointer_groupEPKvtPKNS_9GroupInfoEiRt", scope: !49, file: !32, line: 373, type: !262, scopeLine: 373, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!262 = !DISubroutineType(types: !263)
!263 = !{!8, !100, !54, !164, !170, !264}
!264 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !54, size: 32)
!265 = !DISubprogram(name: "find_key_by_pointer", linkageName: "_ZN8AP_Param19find_key_by_pointerEPKvRt", scope: !49, file: !32, line: 375, type: !266, scopeLine: 375, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!266 = !DISubroutineType(types: !267)
!267 = !{!8, !100, !264}
!268 = !DISubprogram(name: "find_top_level_key_by_pointer", linkageName: "_ZN8AP_Param29find_top_level_key_by_pointerEPKvRt", scope: !49, file: !32, line: 382, type: !266, scopeLine: 382, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!269 = !DISubprogram(name: "find_object", linkageName: "_ZN8AP_Param11find_objectEPKc", scope: !49, file: !32, line: 391, type: !270, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!270 = !DISubroutineType(types: !271)
!271 = !{!52, !138}
!272 = !DISubprogram(name: "notify", linkageName: "_ZNK8AP_Param6notifyEv", scope: !49, file: !32, line: 395, type: !273, scopeLine: 395, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !215}
!275 = !DISubprogram(name: "save_sync", linkageName: "_ZN8AP_Param9save_syncEbb", scope: !49, file: !32, line: 403, type: !276, scopeLine: 403, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !204, !8, !8}
!278 = !DISubprogram(name: "flush", linkageName: "_ZN8AP_Param5flushEv", scope: !49, file: !32, line: 407, type: !16, scopeLine: 407, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!279 = !DISubprogram(name: "save", linkageName: "_ZN8AP_Param4saveEb", scope: !49, file: !32, line: 413, type: !280, scopeLine: 413, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !204, !8}
!282 = !DISubprogram(name: "load", linkageName: "_ZN8AP_Param4loadEv", scope: !49, file: !32, line: 419, type: !283, scopeLine: 419, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!283 = !DISubroutineType(types: !284)
!284 = !{!8, !204}
!285 = !DISubprogram(name: "load_all", linkageName: "_ZN8AP_Param8load_allEv", scope: !49, file: !32, line: 429, type: !19, scopeLine: 429, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!286 = !DISubprogram(name: "storage_used", linkageName: "_ZN8AP_Param12storage_usedEv", scope: !49, file: !32, line: 432, type: !287, scopeLine: 432, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!287 = !DISubroutineType(types: !288)
!288 = !{!54}
!289 = !DISubprogram(name: "storage_size", linkageName: "_ZN8AP_Param12storage_sizeEv", scope: !49, file: !32, line: 435, type: !287, scopeLine: 435, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!290 = !DISubprogram(name: "reload_defaults_file", linkageName: "_ZN8AP_Param20reload_defaults_fileEb", scope: !49, file: !32, line: 439, type: !291, scopeLine: 439, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !8}
!293 = !DISubprogram(name: "load_object_from_eeprom", linkageName: "_ZN8AP_Param23load_object_from_eepromEPKvPKNS_9GroupInfoE", scope: !49, file: !32, line: 441, type: !294, scopeLine: 441, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !100, !164}
!296 = !DISubprogram(name: "set_value", linkageName: "_ZN8AP_Param9set_valueE11ap_var_typePvf", scope: !49, file: !32, line: 444, type: !297, scopeLine: 444, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !31, !92, !117}
!299 = !DISubprogram(name: "set_float", linkageName: "_ZN8AP_Param9set_floatEf11ap_var_type", scope: !49, file: !32, line: 449, type: !300, scopeLine: 449, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !204, !117, !31}
!302 = !DISubprogram(name: "setup_object_defaults", linkageName: "_ZN8AP_Param21setup_object_defaultsEPKvPKNS_9GroupInfoE", scope: !49, file: !32, line: 452, type: !294, scopeLine: 452, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!303 = !DISubprogram(name: "set_object_value", linkageName: "_ZN8AP_Param16set_object_valueEPKvPKNS_9GroupInfoEPKcf", scope: !49, file: !32, line: 457, type: !304, scopeLine: 457, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!304 = !DISubroutineType(types: !305)
!305 = !{!8, !100, !164, !138, !117}
!306 = !DISubprogram(name: "setup_sketch_defaults", linkageName: "_ZN8AP_Param21setup_sketch_defaultsEv", scope: !49, file: !32, line: 463, type: !16, scopeLine: 463, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!307 = !DISubprogram(name: "find_old_parameter", linkageName: "_ZN8AP_Param18find_old_parameterEPKNS_14ConversionInfoEPS_", scope: !49, file: !32, line: 466, type: !308, scopeLine: 466, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!308 = !DISubroutineType(types: !309)
!309 = !{!8, !310, !52}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConversionInfo", scope: !49, file: !32, line: 223, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param14ConversionInfoE")
!313 = !DISubprogram(name: "convert_old_parameters", linkageName: "_ZN8AP_Param22convert_old_parametersEPKNS_14ConversionInfoEhh", scope: !49, file: !32, line: 469, type: !314, scopeLine: 469, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !310, !61, !61}
!316 = !DISubprogram(name: "convert_old_parameters_scaled", linkageName: "_ZN8AP_Param29convert_old_parameters_scaledEPKNS_14ConversionInfoEhfh", scope: !49, file: !32, line: 471, type: !317, scopeLine: 471, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !310, !61, !117, !61}
!319 = !DISubprogram(name: "convert_parameter_width", linkageName: "_ZN8AP_Param23convert_parameter_widthE11ap_var_typef", scope: !49, file: !32, line: 478, type: !320, scopeLine: 478, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DISubroutineType(types: !321)
!321 = !{!8, !204, !31, !117}
!322 = !DISubprogram(name: "convert_centi_parameter", linkageName: "_ZN8AP_Param23convert_centi_parameterE11ap_var_type", scope: !49, file: !32, line: 479, type: !323, scopeLine: 479, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!323 = !DISubroutineType(types: !324)
!324 = !{!8, !204, !31}
!325 = !DISubprogram(name: "convert_old_parameter", linkageName: "_ZN8AP_Param21convert_old_parameterEPKNS_14ConversionInfoEfh", scope: !49, file: !32, line: 488, type: !326, scopeLine: 488, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !310, !117, !61}
!328 = !DISubprogram(name: "convert_class", linkageName: "_ZN8AP_Param13convert_classEtPvPKNS_9GroupInfoEttb", scope: !49, file: !32, line: 492, type: !329, scopeLine: 492, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !54, !92, !164, !54, !54, !8}
!331 = !DISubprogram(name: "get_param_by_index", linkageName: "_ZN8AP_Param18get_param_by_indexEPvh11ap_var_typeS0_", scope: !49, file: !32, line: 501, type: !332, scopeLine: 501, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!332 = !DISubroutineType(types: !333)
!333 = !{!8, !92, !61, !31, !92}
!334 = !DISubprogram(name: "erase_all", linkageName: "_ZN8AP_Param9erase_allEv", scope: !49, file: !32, line: 505, type: !16, scopeLine: 505, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!335 = !DISubprogram(name: "first", linkageName: "_ZN8AP_Param5firstEPNS_10ParamTokenEP11ap_var_typePf", scope: !49, file: !32, line: 512, type: !336, scopeLine: 512, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!336 = !DISubroutineType(types: !337)
!337 = !{!52, !257, !236, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!339 = !DISubprogram(name: "next", linkageName: "_ZN8AP_Param4nextEPNS_10ParamTokenEP11ap_var_type", scope: !49, file: !32, line: 516, type: !340, scopeLine: 516, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!340 = !DISubroutineType(types: !341)
!341 = !{!52, !257, !236}
!342 = !DISubprogram(name: "next", linkageName: "_ZN8AP_Param4nextEPNS_10ParamTokenEP11ap_var_typebPf", scope: !49, file: !32, line: 517, type: !343, scopeLine: 517, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!343 = !DISubroutineType(types: !344)
!344 = !{!52, !257, !236, !8, !338}
!345 = !DISubprogram(name: "next_scalar", linkageName: "_ZN8AP_Param11next_scalarEPNS_10ParamTokenEP11ap_var_typePf", scope: !49, file: !32, line: 521, type: !336, scopeLine: 521, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!346 = !DISubprogram(name: "type_size", linkageName: "_ZN8AP_Param9type_sizeE11ap_var_type", scope: !49, file: !32, line: 524, type: !347, scopeLine: 524, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!347 = !DISubroutineType(types: !348)
!348 = !{!61, !31}
!349 = !DISubprogram(name: "cast_to_float", linkageName: "_ZNK8AP_Param13cast_to_floatE11ap_var_type", scope: !49, file: !32, line: 527, type: !350, scopeLine: 527, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DISubroutineType(types: !351)
!351 = !{!117, !215, !31}
!352 = !DISubprogram(name: "check_var_info", linkageName: "_ZN8AP_Param14check_var_infoEv", scope: !49, file: !32, line: 530, type: !16, scopeLine: 530, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!353 = !DISubprogram(name: "configured", linkageName: "_ZNK8AP_Param10configuredEv", scope: !49, file: !32, line: 533, type: !354, scopeLine: 533, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!354 = !DISubroutineType(types: !355)
!355 = !{!8, !215}
!356 = !DISubprogram(name: "is_read_only", linkageName: "_ZNK8AP_Param12is_read_onlyEv", scope: !49, file: !32, line: 536, type: !354, scopeLine: 536, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DISubprogram(name: "get_persistent_key", linkageName: "_ZN8AP_Param18get_persistent_keyEt", scope: !49, file: !32, line: 539, type: !358, scopeLine: 539, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{!54, !54}
!360 = !DISubprogram(name: "count_parameters", linkageName: "_ZN8AP_Param16count_parametersEv", scope: !49, file: !32, line: 542, type: !287, scopeLine: 542, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!361 = !DISubprogram(name: "invalidate_count", linkageName: "_ZN8AP_Param16invalidate_countEv", scope: !49, file: !32, line: 545, type: !16, scopeLine: 545, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!362 = !DISubprogram(name: "set_hide_disabled_groups", linkageName: "_ZN8AP_Param24set_hide_disabled_groupsEb", scope: !49, file: !32, line: 547, type: !291, scopeLine: 547, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!363 = !DISubprogram(name: "set_frame_type_flags", linkageName: "_ZN8AP_Param20set_frame_type_flagsEt", scope: !49, file: !32, line: 550, type: !364, scopeLine: 550, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !54}
!366 = !DISubprogram(name: "check_frame_type", linkageName: "_ZN8AP_Param16check_frame_typeEt", scope: !49, file: !32, line: 556, type: !367, scopeLine: 556, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!367 = !DISubroutineType(types: !368)
!368 = !{!8, !54}
!369 = !DISubprogram(name: "get_singleton", linkageName: "_ZN8AP_Param13get_singletonEv", scope: !49, file: !32, line: 575, type: !370, scopeLine: 575, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!370 = !DISubroutineType(types: !371)
!371 = !{!52}
!372 = !DISubprogram(name: "add_table", linkageName: "_ZN8AP_Param9add_tableEhPKch", scope: !49, file: !32, line: 579, type: !373, scopeLine: 579, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!373 = !DISubroutineType(types: !374)
!374 = !{!8, !61, !138, !61}
!375 = !DISubprogram(name: "add_param", linkageName: "_ZN8AP_Param9add_paramEhhPKcf", scope: !49, file: !32, line: 580, type: !376, scopeLine: 580, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!376 = !DISubroutineType(types: !377)
!377 = !{!8, !61, !61, !138, !117}
!378 = !DISubprogram(name: "load_int32", linkageName: "_ZN8AP_Param10load_int32EtjRi", scope: !49, file: !32, line: 581, type: !379, scopeLine: 581, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!379 = !DISubroutineType(types: !380)
!380 = !{!8, !54, !112, !381}
!381 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !55, line: 44, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 77, baseType: !172)
!384 = !DISubprogram(name: "load_defaults_file", linkageName: "_ZN8AP_Param18load_defaults_fileEPKcb", scope: !49, file: !32, line: 584, type: !385, scopeLine: 584, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!385 = !DISubroutineType(types: !386)
!386 = !{!8, !138, !8}
!387 = !DISubprogram(name: "add_default", linkageName: "_ZN8AP_Param11add_defaultEPS_f", scope: !49, file: !32, line: 589, type: !388, scopeLine: 589, flags: DIFlagProtected | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !52, !117}
!390 = !DISubprogram(name: "check_group_info", linkageName: "_ZN8AP_Param16check_group_infoEPKNS_9GroupInfoEPthh", scope: !49, file: !32, line: 659, type: !391, scopeLine: 659, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !164, !237, !61, !61}
!393 = !DISubprogram(name: "duplicate_key", linkageName: "_ZN8AP_Param13duplicate_keyEtt", scope: !49, file: !32, line: 661, type: !394, scopeLine: 661, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!394 = !DISubroutineType(types: !395)
!395 = !{!8, !54, !54}
!396 = !DISubprogram(name: "adjust_group_offset", linkageName: "_ZN8AP_Param19adjust_group_offsetEtRKNS_9GroupInfoERi", scope: !49, file: !32, line: 663, type: !397, scopeLine: 663, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!397 = !DISubroutineType(types: !398)
!398 = !{!8, !54, !399, !400}
!399 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !47, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !170, size: 32)
!401 = !DISubprogram(name: "get_base", linkageName: "_ZN8AP_Param8get_baseERKNS_4InfoERi", scope: !49, file: !32, line: 664, type: !402, scopeLine: 664, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!402 = !DISubroutineType(types: !403)
!403 = !{!8, !404, !400}
!404 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !155, size: 32)
!405 = !DISubprogram(name: "get_group_info", linkageName: "_ZN8AP_Param14get_group_infoERKNS_9GroupInfoE", scope: !49, file: !32, line: 667, type: !406, scopeLine: 667, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!406 = !DISubroutineType(types: !407)
!407 = !{!164, !399}
!408 = !DISubprogram(name: "get_group_info", linkageName: "_ZN8AP_Param14get_group_infoERKNS_4InfoE", scope: !49, file: !32, line: 670, type: !409, scopeLine: 670, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!409 = !DISubroutineType(types: !410)
!410 = !{!164, !404}
!411 = !DISubprogram(name: "find_var_info_group", linkageName: "_ZNK8AP_Param19find_var_info_groupEPKNS_9GroupInfoEtjhiPjRS2_RNS_12GroupNestingEPh", scope: !49, file: !32, line: 672, type: !412, scopeLine: 672, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!412 = !DISubroutineType(types: !413)
!413 = !{!154, !215, !164, !54, !112, !61, !170, !414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !164, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !219, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!418 = !DISubprogram(name: "find_var_info", linkageName: "_ZNK8AP_Param13find_var_infoEPjRPKNS_9GroupInfoERNS_12GroupNestingEPh", scope: !49, file: !32, line: 682, type: !419, scopeLine: 682, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!419 = !DISubroutineType(types: !420)
!420 = !{!154, !215, !414, !415, !416, !417}
!421 = !DISubprogram(name: "find_var_info_token", linkageName: "_ZNK8AP_Param19find_var_info_tokenERKNS_10ParamTokenEPjRPKNS_9GroupInfoERNS_12GroupNestingEPh", scope: !49, file: !32, line: 687, type: !422, scopeLine: 687, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!422 = !DISubroutineType(types: !423)
!423 = !{!154, !215, !224, !414, !415, !416, !417}
!424 = !DISubprogram(name: "find_by_header_group", linkageName: "_ZN8AP_Param20find_by_header_groupENS_12Param_headerEPPvtPKNS_9GroupInfoEjhi", scope: !49, file: !32, line: 692, type: !425, scopeLine: 692, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!425 = !DISubroutineType(types: !426)
!426 = !{!154, !427, !433, !54, !164, !112, !61, !170}
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Param_header", scope: !49, file: !32, line: 620, size: 32, flags: DIFlagTypePassByValue, elements: !428, identifier: "_ZTSN8AP_Param12Param_headerE")
!428 = !{!429, !430, !431, !432}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "key_low", scope: !427, file: !32, line: 622, baseType: !112, size: 8, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !32, line: 623, baseType: !112, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "key_high", scope: !427, file: !32, line: 624, baseType: !112, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "group_element", scope: !427, file: !32, line: 625, baseType: !112, size: 18, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!434 = !DISubprogram(name: "find_by_header", linkageName: "_ZN8AP_Param14find_by_headerENS_12Param_headerEPPv", scope: !49, file: !32, line: 699, type: !435, scopeLine: 699, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!435 = !DISubroutineType(types: !436)
!436 = !{!154, !427, !433}
!437 = !DISubprogram(name: "add_vector3f_suffix", linkageName: "_ZNK8AP_Param19add_vector3f_suffixEPcjh", scope: !49, file: !32, line: 702, type: !438, scopeLine: 702, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !215, !220, !93, !61}
!440 = !DISubprogram(name: "find_group", linkageName: "_ZN8AP_Param10find_groupEPKctiPKNS_9GroupInfoEP11ap_var_type", scope: !49, file: !32, line: 706, type: !441, scopeLine: 706, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!441 = !DISubroutineType(types: !442)
!442 = !{!52, !138, !54, !170, !164, !236}
!443 = !DISubprogram(name: "write_sentinal", linkageName: "_ZN8AP_Param14write_sentinalEt", scope: !49, file: !32, line: 712, type: !364, scopeLine: 712, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!444 = !DISubprogram(name: "get_key", linkageName: "_ZN8AP_Param7get_keyERKNS_12Param_headerE", scope: !49, file: !32, line: 713, type: !445, scopeLine: 713, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!445 = !DISubroutineType(types: !446)
!446 = !{!54, !447}
!447 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!449 = !DISubprogram(name: "set_key", linkageName: "_ZN8AP_Param7set_keyERNS_12Param_headerEt", scope: !49, file: !32, line: 714, type: !450, scopeLine: 714, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !452, !54}
!452 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !427, size: 32)
!453 = !DISubprogram(name: "is_sentinal", linkageName: "_ZN8AP_Param11is_sentinalERKNS_12Param_headerE", scope: !49, file: !32, line: 715, type: !454, scopeLine: 715, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!454 = !DISubroutineType(types: !455)
!455 = !{!8, !447}
!456 = !DISubprogram(name: "scan", linkageName: "_ZN8AP_Param4scanEPKNS_12Param_headerEPt", scope: !49, file: !32, line: 716, type: !457, scopeLine: 716, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!457 = !DISubroutineType(types: !458)
!458 = !{!8, !459, !237}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!460 = !DISubprogram(name: "eeprom_write_check", linkageName: "_ZN8AP_Param18eeprom_write_checkEPKvth", scope: !49, file: !32, line: 719, type: !461, scopeLine: 719, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !100, !54, !61}
!463 = !DISubprogram(name: "next_group", linkageName: "_ZN8AP_Param10next_groupEtPKNS_9GroupInfoEPbjhiPNS_10ParamTokenEP11ap_var_typebPf", scope: !49, file: !32, line: 723, type: !464, scopeLine: 723, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!464 = !DISubroutineType(types: !465)
!465 = !{!52, !66, !164, !466, !467, !60, !468, !257, !236, !8, !338}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!469 = !DISubprogram(name: "get_default_value", linkageName: "_ZN8AP_Param17get_default_valueEPKS_RKNS_9GroupInfoE", scope: !49, file: !32, line: 736, type: !470, scopeLine: 736, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!470 = !DISubroutineType(types: !471)
!471 = !{!117, !472, !399}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!473 = !DISubprogram(name: "get_default_value", linkageName: "_ZN8AP_Param17get_default_valueEPKS_RKNS_4InfoE", scope: !49, file: !32, line: 737, type: !474, scopeLine: 737, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!474 = !DISubroutineType(types: !475)
!475 = !{!117, !472, !404}
!476 = !DISubprogram(name: "parse_param_line", linkageName: "_ZN8AP_Param16parse_param_lineEPcPS0_RfRb", scope: !49, file: !32, line: 739, type: !477, scopeLine: 739, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!477 = !DISubroutineType(types: !478)
!478 = !{!8, !220, !479, !251, !480}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8, size: 32)
!481 = !DISubprogram(name: "count_defaults_in_file", linkageName: "_ZN8AP_Param22count_defaults_in_fileEPKcRt", scope: !49, file: !32, line: 744, type: !482, scopeLine: 744, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!482 = !DISubroutineType(types: !483)
!483 = !{!8, !138, !264}
!484 = !DISubprogram(name: "count_param_defaults", linkageName: "_ZN8AP_Param20count_param_defaultsEPVKciRt", scope: !49, file: !32, line: 745, type: !485, scopeLine: 745, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!485 = !DISubroutineType(types: !486)
!486 = !{!8, !487, !382, !264}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !140)
!490 = !DISubprogram(name: "read_param_defaults_file", linkageName: "_ZN8AP_Param24read_param_defaults_fileEPKcbRt", scope: !49, file: !32, line: 746, type: !491, scopeLine: 746, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!491 = !DISubroutineType(types: !492)
!492 = !{!8, !138, !8, !264}
!493 = !DISubprogram(name: "load_defaults_file_from_filesystem", linkageName: "_ZN8AP_Param34load_defaults_file_from_filesystemEPKcb", scope: !49, file: !32, line: 749, type: !494, scopeLine: 749, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !138, !8}
!496 = !DISubprogram(name: "load_defaults_file_from_romfs", linkageName: "_ZN8AP_Param29load_defaults_file_from_romfsEPKcb", scope: !49, file: !32, line: 751, type: !494, scopeLine: 751, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!497 = !DISubprogram(name: "load_param_defaults", linkageName: "_ZN8AP_Param19load_param_defaultsEPVKcib", scope: !49, file: !32, line: 754, type: !498, scopeLine: 754, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !487, !382, !8}
!500 = !DISubprogram(name: "count_embedded_param_defaults", linkageName: "_ZN8AP_Param29count_embedded_param_defaultsERt", scope: !49, file: !32, line: 759, type: !501, scopeLine: 759, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!501 = !DISubroutineType(types: !502)
!502 = !{!8, !264}
!503 = !DISubprogram(name: "load_embedded_param_defaults", linkageName: "_ZN8AP_Param28load_embedded_param_defaultsEb", scope: !49, file: !32, line: 760, type: !291, scopeLine: 760, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!504 = !DISubprogram(name: "configured_in_defaults_file", linkageName: "_ZNK8AP_Param27configured_in_defaults_fileERb", scope: !49, file: !32, line: 763, type: !505, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!505 = !DISubroutineType(types: !506)
!506 = !{!8, !215, !480}
!507 = !DISubprogram(name: "configured_in_storage", linkageName: "_ZNK8AP_Param21configured_in_storageEv", scope: !49, file: !32, line: 766, type: !354, scopeLine: 766, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!508 = !DISubprogram(name: "send_parameter", linkageName: "_ZNK8AP_Param14send_parameterEPKc11ap_var_typeh", scope: !49, file: !32, line: 769, type: !509, scopeLine: 769, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !215, !138, !31, !61}
!511 = !DISubprogram(name: "var_info", linkageName: "_ZN8AP_Param8var_infoEt", scope: !49, file: !32, line: 784, type: !512, scopeLine: 784, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!512 = !DISubroutineType(types: !513)
!513 = !{!404, !54}
!514 = !DISubprogram(name: "save_io_handler", linkageName: "_ZN8AP_Param15save_io_handlerEv", scope: !49, file: !32, line: 825, type: !206, scopeLine: 825, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!515 = !DISubprogram(name: "check_default", linkageName: "_ZN8AP_Param13check_defaultEPS_Pf", scope: !49, file: !32, line: 834, type: !516, scopeLine: 834, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !52, !338}
!518 = !{!519}
!519 = !DISubrange(count: -1)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "var_info2", scope: !43, file: !42, line: 41, baseType: !46, flags: DIFlagPublic | DIFlagStaticMember)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "num_cores", scope: !43, file: !42, line: 369, baseType: !61, size: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !43, file: !42, line: 370, baseType: !61, size: 8, offset: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !43, file: !42, line: 371, baseType: !524, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DICompositeType(tag: DW_TAG_class_type, name: "NavEKF3_core", file: !42, line: 28, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS12NavEKF3_core")
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_frameTimeUsec", scope: !43, file: !42, line: 373, baseType: !112, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_framesPerPrediction", scope: !43, file: !42, line: 374, baseType: !61, size: 8, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_enable", scope: !43, file: !42, line: 385, baseType: !529, size: 8, offset: 104)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "AP_Int8", file: !32, line: 1029, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_ParamT<signed char, AP_PARAM_INT8>", file: !32, line: 850, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !531, templateParams: !558, identifier: "_ZTS9AP_ParamTIaL11ap_var_type1EE")
!531 = !{!532, !533, !535, !537, !544, !548, !549, !550, !551, !552, !553, !554, !555}
!532 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !530, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !530, file: !32, line: 853, baseType: !534, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !530, file: !32, line: 906, baseType: !536, size: 8, flags: DIFlagProtected)
!536 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!537 = !DISubprogram(name: "get", linkageName: "_ZNK9AP_ParamTIaL11ap_var_type1EE3getEv", scope: !530, file: !32, line: 857, type: !538, scopeLine: 857, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!538 = !DISubroutineType(types: !539)
!539 = !{!540, !542}
!540 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!544 = !DISubprogram(name: "set", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE3setERKa", scope: !530, file: !32, line: 863, type: !545, scopeLine: 863, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !547, !540}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!548 = !DISubprogram(name: "set_enable", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE10set_enableERKa", scope: !530, file: !32, line: 868, type: !545, scopeLine: 868, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!549 = !DISubprogram(name: "set_default", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE11set_defaultERKa", scope: !530, file: !32, line: 872, type: !545, scopeLine: 872, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!550 = !DISubprogram(name: "set_and_default", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE15set_and_defaultERKa", scope: !530, file: !32, line: 876, type: !545, scopeLine: 876, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!551 = !DISubprogram(name: "set_and_notify", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE14set_and_notifyERKa", scope: !530, file: !32, line: 880, type: !545, scopeLine: 880, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!552 = !DISubprogram(name: "set_and_save", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE12set_and_saveERKa", scope: !530, file: !32, line: 884, type: !545, scopeLine: 884, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!553 = !DISubprogram(name: "set_and_save_ifchanged", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE22set_and_save_ifchangedERKa", scope: !530, file: !32, line: 891, type: !545, scopeLine: 891, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!554 = !DISubprogram(name: "operator const signed char &", linkageName: "_ZNK9AP_ParamTIaL11ap_var_type1EEcvRKaEv", scope: !530, file: !32, line: 897, type: !538, scopeLine: 897, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!555 = !DISubprogram(name: "cast_to_float", linkageName: "_ZNK9AP_ParamTIaL11ap_var_type1EE13cast_to_floatEv", scope: !530, file: !32, line: 903, type: !556, scopeLine: 903, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!556 = !DISubroutineType(types: !557)
!557 = !{!117, !542}
!558 = !{!559, !560}
!559 = !DITemplateTypeParameter(name: "T", type: !536)
!560 = !DITemplateValueParameter(name: "PT", type: !31, value: i32 1)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsHorizVelNoise", scope: !43, file: !42, line: 386, baseType: !562, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "AP_Float", file: !32, line: 1028, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_ParamT<float, AP_PARAM_FLOAT>", file: !32, line: 850, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !564, templateParams: !588, identifier: "_ZTS9AP_ParamTIfL11ap_var_type4EE")
!564 = !{!565, !566, !567, !568, !574, !578, !579, !580, !581, !582, !583, !584, !585}
!565 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !563, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !563, file: !32, line: 853, baseType: !534, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !563, file: !32, line: 906, baseType: !117, size: 32, flags: DIFlagProtected)
!568 = !DISubprogram(name: "get", linkageName: "_ZNK9AP_ParamTIfL11ap_var_type4EE3getEv", scope: !563, file: !32, line: 857, type: !569, scopeLine: 857, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!569 = !DISubroutineType(types: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !168, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!574 = !DISubprogram(name: "set", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE3setERKf", scope: !563, file: !32, line: 863, type: !575, scopeLine: 863, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !577, !571}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!578 = !DISubprogram(name: "set_enable", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE10set_enableERKf", scope: !563, file: !32, line: 868, type: !575, scopeLine: 868, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DISubprogram(name: "set_default", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE11set_defaultERKf", scope: !563, file: !32, line: 872, type: !575, scopeLine: 872, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!580 = !DISubprogram(name: "set_and_default", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE15set_and_defaultERKf", scope: !563, file: !32, line: 876, type: !575, scopeLine: 876, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!581 = !DISubprogram(name: "set_and_notify", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE14set_and_notifyERKf", scope: !563, file: !32, line: 880, type: !575, scopeLine: 880, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!582 = !DISubprogram(name: "set_and_save", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE12set_and_saveERKf", scope: !563, file: !32, line: 884, type: !575, scopeLine: 884, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!583 = !DISubprogram(name: "set_and_save_ifchanged", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE22set_and_save_ifchangedERKf", scope: !563, file: !32, line: 891, type: !575, scopeLine: 891, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!584 = !DISubprogram(name: "operator const float &", linkageName: "_ZNK9AP_ParamTIfL11ap_var_type4EEcvRKfEv", scope: !563, file: !32, line: 897, type: !569, scopeLine: 897, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!585 = !DISubprogram(name: "cast_to_float", linkageName: "_ZNK9AP_ParamTIfL11ap_var_type4EE13cast_to_floatEv", scope: !563, file: !32, line: 903, type: !586, scopeLine: 903, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!586 = !DISubroutineType(types: !587)
!587 = !{!117, !572}
!588 = !{!589, !590}
!589 = !DITemplateTypeParameter(name: "T", type: !117)
!590 = !DITemplateValueParameter(name: "PT", type: !31, value: i32 4)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsVertVelNoise", scope: !43, file: !42, line: 387, baseType: !562, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsHorizPosNoise", scope: !43, file: !42, line: 388, baseType: !562, size: 32, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_baroAltNoise", scope: !43, file: !42, line: 389, baseType: !562, size: 32, offset: 224)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_magNoise", scope: !43, file: !42, line: 390, baseType: !562, size: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_easNoise", scope: !43, file: !42, line: 391, baseType: !562, size: 32, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_windVelProcessNoise", scope: !43, file: !42, line: 392, baseType: !562, size: 32, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_wndVarHgtRateScale", scope: !43, file: !42, line: 393, baseType: !562, size: 32, offset: 352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_magEarthProcessNoise", scope: !43, file: !42, line: 394, baseType: !562, size: 32, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_magBodyProcessNoise", scope: !43, file: !42, line: 395, baseType: !562, size: 32, offset: 416)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_gyrNoise", scope: !43, file: !42, line: 396, baseType: !562, size: 32, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_accNoise", scope: !43, file: !42, line: 397, baseType: !562, size: 32, offset: 480)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_gyroBiasProcessNoise", scope: !43, file: !42, line: 398, baseType: !562, size: 32, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_accelBiasProcessNoise", scope: !43, file: !42, line: 399, baseType: !562, size: 32, offset: 544)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_hgtDelay_ms", scope: !43, file: !42, line: 400, baseType: !605, size: 16, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "AP_Int16", file: !32, line: 1030, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_ParamT<short, AP_PARAM_INT16>", file: !32, line: 850, size: 16, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !607, templateParams: !633, identifier: "_ZTS9AP_ParamTIsL11ap_var_type2EE")
!607 = !{!608, !609, !610, !612, !619, !623, !624, !625, !626, !627, !628, !629, !630}
!608 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !606, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !606, file: !32, line: 853, baseType: !534, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !606, file: !32, line: 906, baseType: !611, size: 16, flags: DIFlagProtected)
!611 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!612 = !DISubprogram(name: "get", linkageName: "_ZNK9AP_ParamTIsL11ap_var_type2EE3getEv", scope: !606, file: !32, line: 857, type: !613, scopeLine: 857, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!613 = !DISubroutineType(types: !614)
!614 = !{!615, !617}
!615 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!619 = !DISubprogram(name: "set", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE3setERKs", scope: !606, file: !32, line: 863, type: !620, scopeLine: 863, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !622, !615}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!623 = !DISubprogram(name: "set_enable", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE10set_enableERKs", scope: !606, file: !32, line: 868, type: !620, scopeLine: 868, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!624 = !DISubprogram(name: "set_default", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE11set_defaultERKs", scope: !606, file: !32, line: 872, type: !620, scopeLine: 872, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!625 = !DISubprogram(name: "set_and_default", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE15set_and_defaultERKs", scope: !606, file: !32, line: 876, type: !620, scopeLine: 876, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!626 = !DISubprogram(name: "set_and_notify", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE14set_and_notifyERKs", scope: !606, file: !32, line: 880, type: !620, scopeLine: 880, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!627 = !DISubprogram(name: "set_and_save", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE12set_and_saveERKs", scope: !606, file: !32, line: 884, type: !620, scopeLine: 884, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!628 = !DISubprogram(name: "set_and_save_ifchanged", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE22set_and_save_ifchangedERKs", scope: !606, file: !32, line: 891, type: !620, scopeLine: 891, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!629 = !DISubprogram(name: "operator const short &", linkageName: "_ZNK9AP_ParamTIsL11ap_var_type2EEcvRKsEv", scope: !606, file: !32, line: 897, type: !613, scopeLine: 897, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!630 = !DISubprogram(name: "cast_to_float", linkageName: "_ZNK9AP_ParamTIsL11ap_var_type2EE13cast_to_floatEv", scope: !606, file: !32, line: 903, type: !631, scopeLine: 903, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!631 = !DISubroutineType(types: !632)
!632 = !{!117, !617}
!633 = !{!634, !635}
!634 = !DITemplateTypeParameter(name: "T", type: !611)
!635 = !DITemplateValueParameter(name: "PT", type: !31, value: i32 2)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsVelInnovGate", scope: !43, file: !42, line: 401, baseType: !605, size: 16, offset: 592)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsPosInnovGate", scope: !43, file: !42, line: 402, baseType: !605, size: 16, offset: 608)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_hgtInnovGate", scope: !43, file: !42, line: 403, baseType: !605, size: 16, offset: 624)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_magInnovGate", scope: !43, file: !42, line: 404, baseType: !605, size: 16, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_tasInnovGate", scope: !43, file: !42, line: 405, baseType: !605, size: 16, offset: 656)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_magCal", scope: !43, file: !42, line: 406, baseType: !529, size: 8, offset: 672)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsGlitchRadiusMax", scope: !43, file: !42, line: 407, baseType: !529, size: 8, offset: 680)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_flowNoise", scope: !43, file: !42, line: 408, baseType: !562, size: 32, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_flowInnovGate", scope: !43, file: !42, line: 409, baseType: !605, size: 16, offset: 736)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_flowDelay_ms", scope: !43, file: !42, line: 410, baseType: !529, size: 8, offset: 752)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_rngInnovGate", scope: !43, file: !42, line: 411, baseType: !605, size: 16, offset: 768)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_maxFlowRate", scope: !43, file: !42, line: 412, baseType: !562, size: 32, offset: 800)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_rngNoise", scope: !43, file: !42, line: 413, baseType: !562, size: 32, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsCheck", scope: !43, file: !42, line: 414, baseType: !529, size: 8, offset: 864)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_imuMask", scope: !43, file: !42, line: 415, baseType: !529, size: 8, offset: 872)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsCheckScaler", scope: !43, file: !42, line: 416, baseType: !605, size: 16, offset: 880)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_noaidHorizNoise", scope: !43, file: !42, line: 417, baseType: !562, size: 32, offset: 896)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_yawNoise", scope: !43, file: !42, line: 418, baseType: !562, size: 32, offset: 928)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_yawInnovGate", scope: !43, file: !42, line: 419, baseType: !605, size: 16, offset: 960)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_tauVelPosOutput", scope: !43, file: !42, line: 420, baseType: !529, size: 8, offset: 976)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_useRngSwHgt", scope: !43, file: !42, line: 421, baseType: !529, size: 8, offset: 984)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_terrGradMax", scope: !43, file: !42, line: 422, baseType: !562, size: 32, offset: 992)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_rngBcnNoise", scope: !43, file: !42, line: 423, baseType: !562, size: 32, offset: 1024)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_rngBcnInnovGate", scope: !43, file: !42, line: 424, baseType: !605, size: 16, offset: 1056)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_rngBcnDelay_ms", scope: !43, file: !42, line: 425, baseType: !529, size: 8, offset: 1072)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_useRngSwSpd", scope: !43, file: !42, line: 426, baseType: !562, size: 32, offset: 1088)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_accBiasLim", scope: !43, file: !42, line: 427, baseType: !562, size: 32, offset: 1120)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_magMask", scope: !43, file: !42, line: 428, baseType: !529, size: 8, offset: 1152)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_originHgtMode", scope: !43, file: !42, line: 429, baseType: !529, size: 8, offset: 1160)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_visOdmVelErrMax", scope: !43, file: !42, line: 430, baseType: !562, size: 32, offset: 1184)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_visOdmVelErrMin", scope: !43, file: !42, line: 431, baseType: !562, size: 32, offset: 1216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_wencOdmVelErr", scope: !43, file: !42, line: 432, baseType: !562, size: 32, offset: 1248)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_flowUse", scope: !43, file: !42, line: 433, baseType: !529, size: 8, offset: 1280)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_hrt_filt_freq", scope: !43, file: !42, line: 434, baseType: !562, size: 32, offset: 1312)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_mag_ef_limit", scope: !43, file: !42, line: 435, baseType: !605, size: 16, offset: 1344)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_gsfRunMask", scope: !43, file: !42, line: 436, baseType: !529, size: 8, offset: 1360)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_gsfUseMask", scope: !43, file: !42, line: 437, baseType: !529, size: 8, offset: 1368)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_gsfResetMaxCount", scope: !43, file: !42, line: 438, baseType: !529, size: 8, offset: 1376)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_err_thresh", scope: !43, file: !42, line: 439, baseType: !562, size: 32, offset: 1408)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_affinity", scope: !43, file: !42, line: 440, baseType: !676, size: 32, offset: 1440)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "AP_Int32", file: !32, line: 1031, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_ParamT<int, AP_PARAM_INT32>", file: !32, line: 850, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !678, templateParams: !703, identifier: "_ZTS9AP_ParamTIiL11ap_var_type3EE")
!678 = !{!679, !680, !681, !682, !689, !693, !694, !695, !696, !697, !698, !699, !700}
!679 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !677, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !677, file: !32, line: 853, baseType: !534, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 3)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !677, file: !32, line: 906, baseType: !172, size: 32, flags: DIFlagProtected)
!682 = !DISubprogram(name: "get", linkageName: "_ZNK9AP_ParamTIiL11ap_var_type3EE3getEv", scope: !677, file: !32, line: 857, type: !683, scopeLine: 857, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!683 = !DISubroutineType(types: !684)
!684 = !{!685, !687}
!685 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!689 = !DISubprogram(name: "set", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE3setERKi", scope: !677, file: !32, line: 863, type: !690, scopeLine: 863, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !692, !685}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!693 = !DISubprogram(name: "set_enable", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE10set_enableERKi", scope: !677, file: !32, line: 868, type: !690, scopeLine: 868, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!694 = !DISubprogram(name: "set_default", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE11set_defaultERKi", scope: !677, file: !32, line: 872, type: !690, scopeLine: 872, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!695 = !DISubprogram(name: "set_and_default", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE15set_and_defaultERKi", scope: !677, file: !32, line: 876, type: !690, scopeLine: 876, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!696 = !DISubprogram(name: "set_and_notify", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE14set_and_notifyERKi", scope: !677, file: !32, line: 880, type: !690, scopeLine: 880, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!697 = !DISubprogram(name: "set_and_save", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE12set_and_saveERKi", scope: !677, file: !32, line: 884, type: !690, scopeLine: 884, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!698 = !DISubprogram(name: "set_and_save_ifchanged", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE22set_and_save_ifchangedERKi", scope: !677, file: !32, line: 891, type: !690, scopeLine: 891, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!699 = !DISubprogram(name: "operator const int &", linkageName: "_ZNK9AP_ParamTIiL11ap_var_type3EEcvRKiEv", scope: !677, file: !32, line: 897, type: !683, scopeLine: 897, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!700 = !DISubprogram(name: "cast_to_float", linkageName: "_ZNK9AP_ParamTIiL11ap_var_type3EE13cast_to_floatEv", scope: !677, file: !32, line: 903, type: !701, scopeLine: 903, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!701 = !DISubroutineType(types: !702)
!702 = !{!117, !687}
!703 = !{!704, !705}
!704 = !DITemplateTypeParameter(name: "T", type: !172)
!705 = !DITemplateValueParameter(name: "PT", type: !31, value: i32 3)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_dragObsNoise", scope: !43, file: !42, line: 441, baseType: !562, size: 32, offset: 1472)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_ballisticCoef_x", scope: !43, file: !42, line: 442, baseType: !562, size: 32, offset: 1504)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_ballisticCoef_y", scope: !43, file: !42, line: 443, baseType: !562, size: 32, offset: 1536)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_momentumDragCoef", scope: !43, file: !42, line: 444, baseType: !562, size: 32, offset: 1568)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_betaMask", scope: !43, file: !42, line: 445, baseType: !529, size: 8, offset: 1600)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_ognmTestScaleFactor", scope: !43, file: !42, line: 446, baseType: !562, size: 32, offset: 1632)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_baroGndEffectDeadZone", scope: !43, file: !42, line: 447, baseType: !562, size: 32, offset: 1664)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_primary_core", scope: !43, file: !42, line: 448, baseType: !529, size: 8, offset: 1696)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_log_level", scope: !43, file: !42, line: 449, baseType: !715, size: 8, offset: 1704)
!715 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_Enum<NavEKF3::LogLevel>", file: !32, line: 1044, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !716, templateParams: !728, identifier: "_ZTS7AP_EnumIN7NavEKF38LogLevelEE")
!716 = !{!717, !718, !724}
!717 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !715, baseType: !529, flags: DIFlagPublic, extraData: i32 0)
!718 = !DISubprogram(name: "operator const NavEKF3::LogLevel", linkageName: "_ZNK7AP_EnumIN7NavEKF38LogLevelEEcvKS1_Ev", scope: !715, file: !32, line: 1047, type: !719, scopeLine: 1047, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!724 = !DISubprogram(name: "set", linkageName: "_ZN7AP_EnumIN7NavEKF38LogLevelEE3setES1_", scope: !715, file: !32, line: 1050, type: !725, scopeLine: 1050, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !727, !41}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!728 = !{!729}
!729 = !DITemplateTypeParameter(name: "eclass", type: !41)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsVAccThreshold", scope: !43, file: !42, line: 450, baseType: !562, size: 32, offset: 1728)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "gpsNEVelVarAccScale", scope: !43, file: !42, line: 458, baseType: !168, size: 32, offset: 1760)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "gpsDVelVarAccScale", scope: !43, file: !42, line: 459, baseType: !168, size: 32, offset: 1792)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gpsPosVarAccScale", scope: !43, file: !42, line: 460, baseType: !168, size: 32, offset: 1824)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "extNavVelVarAccScale", scope: !43, file: !42, line: 461, baseType: !168, size: 32, offset: 1856)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "magDelay_ms", scope: !43, file: !42, line: 462, baseType: !66, size: 16, offset: 1888)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "tasDelay_ms", scope: !43, file: !42, line: 463, baseType: !66, size: 16, offset: 1904)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tiltDriftTimeMax_ms", scope: !43, file: !42, line: 464, baseType: !66, size: 16, offset: 1920)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "posRetryTimeUseVel_ms", scope: !43, file: !42, line: 465, baseType: !66, size: 16, offset: 1936)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "posRetryTimeNoVel_ms", scope: !43, file: !42, line: 466, baseType: !66, size: 16, offset: 1952)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "hgtRetryTimeMode0_ms", scope: !43, file: !42, line: 467, baseType: !66, size: 16, offset: 1968)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "hgtRetryTimeMode12_ms", scope: !43, file: !42, line: 468, baseType: !66, size: 16, offset: 1984)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tasRetryTime_ms", scope: !43, file: !42, line: 469, baseType: !66, size: 16, offset: 2000)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dragFailTimeLimit_ms", scope: !43, file: !42, line: 470, baseType: !66, size: 16, offset: 2016)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "magFailTimeLimit_ms", scope: !43, file: !42, line: 471, baseType: !467, size: 32, offset: 2048)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "magVarRateScale", scope: !43, file: !42, line: 472, baseType: !168, size: 32, offset: 2080)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gyroBiasNoiseScaler", scope: !43, file: !42, line: 473, baseType: !168, size: 32, offset: 2112)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "hgtAvg_ms", scope: !43, file: !42, line: 474, baseType: !66, size: 16, offset: 2144)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "betaAvg_ms", scope: !43, file: !42, line: 475, baseType: !66, size: 16, offset: 2160)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "covTimeStepMax", scope: !43, file: !42, line: 476, baseType: !168, size: 32, offset: 2176)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "covDelAngMax", scope: !43, file: !42, line: 477, baseType: !168, size: 32, offset: 2208)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "DCM33FlowMin", scope: !43, file: !42, line: 478, baseType: !168, size: 32, offset: 2240)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fScaleFactorPnoise", scope: !43, file: !42, line: 479, baseType: !168, size: 32, offset: 2272)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flowTimeDeltaAvg_ms", scope: !43, file: !42, line: 480, baseType: !60, size: 8, offset: 2304)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flowIntervalMax_ms", scope: !43, file: !42, line: 481, baseType: !467, size: 32, offset: 2336)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gndEffectBaroScaler", scope: !43, file: !42, line: 482, baseType: !168, size: 32, offset: 2368)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gndGradientSigma", scope: !43, file: !42, line: 483, baseType: !60, size: 8, offset: 2400)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fusionTimeStep_ms", scope: !43, file: !42, line: 484, baseType: !66, size: 16, offset: 2416)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sensorIntervalMin_ms", scope: !43, file: !42, line: 485, baseType: !60, size: 8, offset: 2432)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flowIntervalMin_ms", scope: !43, file: !42, line: 486, baseType: !60, size: 8, offset: 2440)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "extNavIntervalMin_ms", scope: !43, file: !42, line: 487, baseType: !60, size: 8, offset: 2448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "maxYawEstVelInnov", scope: !43, file: !42, line: 488, baseType: !168, size: 32, offset: 2464)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "deadReckonDeclare_ms", scope: !43, file: !42, line: 489, baseType: !66, size: 16, offset: 2496)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "imuSampleTime_us", scope: !43, file: !42, line: 492, baseType: !764, size: 64, offset: 2560)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !55, line: 60, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !57, line: 105, baseType: !766)
!766 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lastLaneSwitch_ms", scope: !43, file: !42, line: 495, baseType: !112, size: 32, offset: 2624)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lastLogWrite_us", scope: !43, file: !42, line: 498, baseType: !764, size: 64, offset: 2688)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "yaw_reset_data", scope: !43, file: !42, line: 505, baseType: !770, size: 128, offset: 2752)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !43, file: !42, line: 500, size: 128, flags: DIFlagTypePassByValue, elements: !771, identifier: "_ZTSN7NavEKF3Ut_E")
!771 = !{!772, !773, !774, !775}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "last_function_call", scope: !770, file: !42, line: 501, baseType: !112, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "core_changed", scope: !770, file: !42, line: 502, baseType: !8, size: 8, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "last_primary_change", scope: !770, file: !42, line: 503, baseType: !112, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "core_delta", scope: !770, file: !42, line: 504, baseType: !117, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pos_reset_data", scope: !43, file: !42, line: 512, baseType: !777, size: 160, offset: 2880)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !43, file: !42, line: 507, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !778, identifier: "_ZTSN7NavEKF3Ut0_E")
!778 = !{!779, !780, !781, !782}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "last_function_call", scope: !777, file: !42, line: 508, baseType: !112, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "core_changed", scope: !777, file: !42, line: 509, baseType: !8, size: 8, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "last_primary_change", scope: !777, file: !42, line: 510, baseType: !112, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "core_delta", scope: !777, file: !42, line: 511, baseType: !783, size: 64, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vector2f", file: !784, line: 297, baseType: !785)
!784 = !DIFile(filename: "../../libraries/AP_Math/vector2.h", directory: "/workdisk/akul/fire/fin/ardupilot/build/Pixhawk6C")
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vector2<float>", file: !784, line: 42, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !786, templateParams: !1007, identifier: "_ZTS7Vector2IfE")
!786 = !{!787, !788, !789, !793, !796, !802, !803, !806, !809, !810, !813, !814, !818, !819, !822, !823, !826, !827, !828, !829, !832, !835, !836, !837, !840, !843, !844, !845, !846, !849, !850, !851, !854, !855, !856, !859, !862, !863, !980, !983, !986, !987, !990, !991, !994, !997, !998, !1001, !1004}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !785, file: !784, line: 44, baseType: !117, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !785, file: !784, line: 44, baseType: !117, size: 32, offset: 32)
!789 = !DISubprogram(name: "Vector2", scope: !785, file: !784, line: 47, type: !790, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!793 = !DISubprogram(name: "Vector2", scope: !785, file: !784, line: 52, type: !794, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !792, !168, !168}
!796 = !DISubprogram(name: "operator==", linkageName: "_ZNK7Vector2IfEeqERKS0_", scope: !785, file: !784, line: 57, type: !797, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!797 = !DISubroutineType(types: !798)
!798 = !{!8, !799, !801}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!801 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !800, size: 32)
!802 = !DISubprogram(name: "operator!=", linkageName: "_ZNK7Vector2IfEneERKS0_", scope: !785, file: !784, line: 60, type: !797, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!803 = !DISubprogram(name: "operator-", linkageName: "_ZNK7Vector2IfEngEv", scope: !785, file: !784, line: 63, type: !804, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!804 = !DISubroutineType(types: !805)
!805 = !{!785, !799}
!806 = !DISubprogram(name: "operator+", linkageName: "_ZNK7Vector2IfEplERKS0_", scope: !785, file: !784, line: 66, type: !807, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!807 = !DISubroutineType(types: !808)
!808 = !{!785, !799, !801}
!809 = !DISubprogram(name: "operator-", linkageName: "_ZNK7Vector2IfEmiERKS0_", scope: !785, file: !784, line: 69, type: !807, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!810 = !DISubprogram(name: "operator*", linkageName: "_ZNK7Vector2IfEmlEf", scope: !785, file: !784, line: 72, type: !811, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!811 = !DISubroutineType(types: !812)
!812 = !{!785, !799, !168}
!813 = !DISubprogram(name: "operator/", linkageName: "_ZNK7Vector2IfEdvEf", scope: !785, file: !784, line: 75, type: !811, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!814 = !DISubprogram(name: "operator+=", linkageName: "_ZN7Vector2IfEpLERKS0_", scope: !785, file: !784, line: 78, type: !815, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!815 = !DISubroutineType(types: !816)
!816 = !{!817, !792, !801}
!817 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !785, size: 32)
!818 = !DISubprogram(name: "operator-=", linkageName: "_ZN7Vector2IfEmIERKS0_", scope: !785, file: !784, line: 81, type: !815, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!819 = !DISubprogram(name: "operator*=", linkageName: "_ZN7Vector2IfEmLEf", scope: !785, file: !784, line: 84, type: !820, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!820 = !DISubroutineType(types: !821)
!821 = !{!817, !792, !168}
!822 = !DISubprogram(name: "operator/=", linkageName: "_ZN7Vector2IfEdVEf", scope: !785, file: !784, line: 87, type: !820, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!823 = !DISubprogram(name: "operator*", linkageName: "_ZNK7Vector2IfEmlERKS0_", scope: !785, file: !784, line: 90, type: !824, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!824 = !DISubroutineType(types: !825)
!825 = !{!117, !799, !801}
!826 = !DISubprogram(name: "dot", linkageName: "_ZNK7Vector2IfE3dotERKS0_", scope: !785, file: !784, line: 93, type: !824, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!827 = !DISubprogram(name: "operator%", linkageName: "_ZNK7Vector2IfErmERKS0_", scope: !785, file: !784, line: 98, type: !824, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!828 = !DISubprogram(name: "angle", linkageName: "_ZNK7Vector2IfE5angleERKS0_", scope: !785, file: !784, line: 102, type: !824, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!829 = !DISubprogram(name: "angle", linkageName: "_ZNK7Vector2IfE5angleEv", scope: !785, file: !784, line: 106, type: !830, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!830 = !DISubroutineType(types: !831)
!831 = !{!117, !799}
!832 = !DISubprogram(name: "is_nan", linkageName: "_ZNK7Vector2IfE6is_nanEv", scope: !785, file: !784, line: 109, type: !833, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DISubroutineType(types: !834)
!834 = !{!8, !799}
!835 = !DISubprogram(name: "is_inf", linkageName: "_ZNK7Vector2IfE6is_infEv", scope: !785, file: !784, line: 112, type: !833, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!836 = !DISubprogram(name: "is_zero", linkageName: "_ZNK7Vector2IfE7is_zeroEv", scope: !785, file: !784, line: 285, type: !833, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!837 = !DISubprogram(name: "operator[]", linkageName: "_ZN7Vector2IfEixEh", scope: !785, file: !784, line: 120, type: !838, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!838 = !DISubroutineType(types: !839)
!839 = !{!251, !792, !61}
!840 = !DISubprogram(name: "operator[]", linkageName: "_ZNK7Vector2IfEixEh", scope: !785, file: !784, line: 128, type: !841, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!841 = !DISubroutineType(types: !842)
!842 = !{!571, !799, !61}
!843 = !DISubprogram(name: "zero", linkageName: "_ZN7Vector2IfE4zeroEv", scope: !785, file: !784, line: 137, type: !790, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!844 = !DISubprogram(name: "length_squared", linkageName: "_ZNK7Vector2IfE14length_squaredEv", scope: !785, file: !784, line: 143, type: !830, scopeLine: 143, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!845 = !DISubprogram(name: "length", linkageName: "_ZNK7Vector2IfE6lengthEv", scope: !785, file: !784, line: 146, type: !830, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!846 = !DISubprogram(name: "limit_length", linkageName: "_ZN7Vector2IfE12limit_lengthEf", scope: !785, file: !784, line: 149, type: !847, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!847 = !DISubroutineType(types: !848)
!848 = !{!8, !792, !117}
