; ModuleID = 'AP_AHRS_View.cpp.0.o'
source_filename = "../../libraries/AP_AHRS/AP_AHRS_View.cpp"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%class.AP_AHRS_View = type { i32 (...)**, float, float, float, i32, i32, i32, i8, %class.AP_AHRS*, %class.Matrix3, %class.Matrix3, %class.Matrix3, %class.Vector3, %struct.anon.11, float, float }
%class.Matrix3 = type { %class.Vector3, %class.Vector3, %class.Vector3 }
%class.Vector3 = type { float, float, float }
%struct.anon.11 = type { float, float, float, float, float, float }
%class.AP_AHRS = type <{ %class.NavEKF3, i32, i32, i32, float, float, float, %class.AP_AHRS_View*, i8, [3 x i8], %"class.ChibiOS::Semaphore", %class.AP_ParamT, %class.AP_ParamT, %class.AP_Enum.8, i8, %class.AP_ParamT.0, %class.AP_ParamT.0, %class.AP_ParamT.0, %class.AP_ParamT.0, %class.AP_Enum.9, %class.AP_ParamT, [2 x i8], float, float, float, float, float, float, i8, i8, i16, i32, i8, i8, [2 x i8], %class.Location, i8, [3 x i8], i32, float, float, i32, i8, [3 x i8], %class.AP_ParamV, %class.Vector3, %class.Matrix3, %class.Matrix3, i32, i8, [3 x i8], i32, i8, [3 x i8], i32, i8, i8, [2 x i8], %struct.anon.10, %class.AP_AHRS_DCM, %"struct.AP_AHRS_Backend::Estimates", %class.AP_AHRS_External, %"struct.AP_AHRS_Backend::Estimates", %class.AP_ParamT.1, [6 x i8] }>

!42 = !DIFile(filename: "../../libraries/AP_NavEKF3/AP_NavEKF3.h", directory: "/workdisk/akul/fire/fin/ardupilot/build/Pixhawk6C")
!43 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "NavEKF3", file: !42, line: 31, size: 3968, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !44, identifier: "_ZTS7NavEKF3")
!44 = !{!45, !515, !516, !517, !518, !521, !522, !523, !556, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !701, !702, !703, !704, !705, !706, !707, !708, !709, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !762, !763, !764, !771, !1003, !1010, !1011, !1015, !1017, !1019, !1020, !1022, !1669, !1670, !1804, !1808, !1813, !1817, !1821, !1824, !1825, !1828, !1831, !1836, !1837, !1840, !1843, !1846, !1849, !1853, !1856, !1859, !1860, !1861, !1862, !1863, !1866, !1867, !1868, !1869, !1870, !1873, !1877, !1878, !1881, !1884, !1885, !1886, !1891, !2132, !2135, !2138, !2141, !2144, !2145, !2150, !2153, !2156, !2159, !2162, !2167, !2170, !2173, !2176, !2206, !2212, !2213, !2216, !2219, !2222, !2223, !2226, !2227, !2228, !2229, !2230, !2233, !2234, !2235, !2236, !2237, !2240, !2241, !2242, !2243, !2250, !2253, !2254, !2255, !2258, !2259, !2260}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "var_info", scope: !43, file: !42, line: 40, baseType: !46, flags: DIFlagPublic | DIFlagStaticMember)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, elements: !513)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "GroupInfo", scope: !49, file: !32, line: 197, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param9GroupInfoE")
!49 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_Param", file: !32, line: 191, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !50, identifier: "_ZTS8AP_Param")
!50 = !{!51, !53, !59, !64, !65, !67, !68, !69, !70, !71, !144, !145, !146, !147, !148, !149, !153, !176, !177, !179, !183, !186, !187, !188, !189, !190, !191, !192, !193, !196, !197, !200, !201, !205, !208, !209, !212, !221, !228, !233, !236, !242, !243, !247, !248, !249, !253, !256, !260, !263, !264, !267, !270, !273, !274, !277, !280, !281, !284, !285, !288, !291, !294, !297, !298, !301, !302, !308, !311, !314, !317, !320, !323, !326, !329, !330, !334, !337, !340, !341, !344, !347, !348, !351, !352, !355, !356, !357, !358, !361, !364, !367, !370, !373, !379, !382, !385, !388, !391, !396, !400, !403, !406, !413, !416, !419, !429, !432, !435, !438, !439, !444, !448, !451, !455, !458, !464, !468, !471, !476, !479, !485, !488, !491, !492, !495, !498, !499, !502, !503, !506, !509, !510}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_singleton", scope: !49, file: !32, line: 592, baseType: !52, flags: DIFlagStaticMember)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "sentinal_offset", scope: !49, file: !32, line: 606, baseType: !54, flags: DIFlagStaticMember)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !55, line: 36, baseType: !56)
!55 = !DIFile(filename: "/opt/gcc-arm-none-eabi-10-2020-q4-major/bin/../arm-none-eabi/include/sys/_stdint.h", directory: "")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !57, line: 57, baseType: !58)
!57 = !DIFile(filename: "/opt/gcc-arm-none-eabi-10-2020-q4-major/bin/../arm-none-eabi/include/machine/_default_types.h", directory: "")
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_group_level_shift", scope: !49, file: !32, line: 630, baseType: !60, flags: DIFlagStaticMember, extraData: i8 6)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !55, line: 24, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !57, line: 43, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_group_bits", scope: !49, file: !32, line: 631, baseType: !60, flags: DIFlagStaticMember, extraData: i8 18)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_sentinal_key", scope: !49, file: !32, line: 633, baseType: !66, flags: DIFlagStaticMember, extraData: i16 511)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sentinal_type", scope: !49, file: !32, line: 634, baseType: !60, flags: DIFlagStaticMember, extraData: i8 31)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sentinal_group", scope: !49, file: !32, line: 635, baseType: !60, flags: DIFlagStaticMember, extraData: i8 -1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_frame_type_flags", scope: !49, file: !32, line: 637, baseType: !54, flags: DIFlagStaticMember)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "done_all_default_params", scope: !49, file: !32, line: 642, baseType: !8, flags: DIFlagStaticMember)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_storage", scope: !49, file: !32, line: 771, baseType: !72, flags: DIFlagStaticMember)
!72 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "StorageAccess", file: !4, line: 91, size: 96, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !73, identifier: "_ZTS13StorageAccess")
!73 = !{!74, !76, !77, !80, !84, !89, !97, !102, !105, !106, !109, !114, !118, !121, !122, !125, !128, !131, !135, !141}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !4, line: 123, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !72, file: !4, line: 124, baseType: !54, size: 16, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !72, file: !4, line: 140, baseType: !78, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileStorage", scope: !72, file: !4, line: 131, size: 448, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN13StorageAccess11FileStorageE")
!80 = !DISubprogram(name: "StorageAccess", scope: !72, file: !4, line: 94, type: !81, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !83, !3}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!84 = !DISubprogram(name: "size", linkageName: "_ZNK13StorageAccess4sizeEv", scope: !72, file: !4, line: 97, type: !85, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{!54, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!89 = !DISubprogram(name: "read_block", linkageName: "_ZNK13StorageAccess10read_blockEPvtj", scope: !72, file: !4, line: 100, type: !90, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubroutineType(types: !91)
!91 = !{!8, !87, !92, !54, !93}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 40, baseType: !95)
!94 = !DIFile(filename: "/opt/gcc-arm-none-eabi-10-2020-q4-major/bin/../arm-none-eabi/include/strings.h", directory: "")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !96, line: 131, baseType: !21)
!96 = !DIFile(filename: "/opt/gcc-arm-none-eabi-10-2020-q4-major/bin/../arm-none-eabi/include/sys/_types.h", directory: "")
!97 = !DISubprogram(name: "write_block", linkageName: "_ZNK13StorageAccess11write_blockEtPKvj", scope: !72, file: !4, line: 101, type: !98, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!98 = !DISubroutineType(types: !99)
!99 = !{!8, !87, !54, !100, !93}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!102 = !DISubprogram(name: "read_byte", linkageName: "_ZNK13StorageAccess9read_byteEt", scope: !72, file: !4, line: 104, type: !103, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!103 = !DISubroutineType(types: !104)
!104 = !{!61, !87, !54}
!105 = !DISubprogram(name: "read_uint8", linkageName: "_ZNK13StorageAccess10read_uint8Et", scope: !72, file: !4, line: 105, type: !103, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!106 = !DISubprogram(name: "read_uint16", linkageName: "_ZNK13StorageAccess11read_uint16Et", scope: !72, file: !4, line: 106, type: !107, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!107 = !DISubroutineType(types: !108)
!108 = !{!54, !87, !54}
!109 = !DISubprogram(name: "read_uint32", linkageName: "_ZNK13StorageAccess11read_uint32Et", scope: !72, file: !4, line: 107, type: !110, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !87, !54}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !55, line: 48, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !57, line: 79, baseType: !21)
!114 = !DISubprogram(name: "read_float", linkageName: "_ZNK13StorageAccess10read_floatEt", scope: !72, file: !4, line: 108, type: !115, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!115 = !DISubroutineType(types: !116)
!116 = !{!117, !87, !54}
!117 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!118 = !DISubprogram(name: "write_byte", linkageName: "_ZNK13StorageAccess10write_byteEth", scope: !72, file: !4, line: 110, type: !119, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !87, !54, !61}
!121 = !DISubprogram(name: "write_uint8", linkageName: "_ZNK13StorageAccess11write_uint8Eth", scope: !72, file: !4, line: 111, type: !119, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!122 = !DISubprogram(name: "write_uint16", linkageName: "_ZNK13StorageAccess12write_uint16Ett", scope: !72, file: !4, line: 112, type: !123, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !87, !54, !54}
!125 = !DISubprogram(name: "write_uint32", linkageName: "_ZNK13StorageAccess12write_uint32Etj", scope: !72, file: !4, line: 113, type: !126, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !87, !54, !112}
!128 = !DISubprogram(name: "write_float", linkageName: "_ZNK13StorageAccess11write_floatEtf", scope: !72, file: !4, line: 114, type: !129, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !87, !54, !117}
!131 = !DISubprogram(name: "copy_area", linkageName: "_ZNK13StorageAccess9copy_areaERKS_", scope: !72, file: !4, line: 117, type: !132, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!132 = !DISubroutineType(types: !133)
!133 = !{!8, !87, !134}
!134 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !88, size: 32)
!135 = !DISubprogram(name: "attach_file", linkageName: "_ZN13StorageAccess11attach_fileEPKct", scope: !72, file: !4, line: 120, type: !136, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!136 = !DISubroutineType(types: !137)
!137 = !{!8, !83, !138, !54}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!141 = !DISubprogram(name: "flush_file", linkageName: "_ZN13StorageAccess10flush_fileEv", scope: !72, file: !4, line: 142, type: !142, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !83}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_storage_bak", scope: !49, file: !32, line: 772, baseType: !72, flags: DIFlagStaticMember)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_num_vars", scope: !49, file: !32, line: 773, baseType: !54, flags: DIFlagStaticMember)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_parameter_count", scope: !49, file: !32, line: 774, baseType: !54, flags: DIFlagStaticMember)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_count_marker", scope: !49, file: !32, line: 775, baseType: !54, flags: DIFlagStaticMember)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_count_marker_done", scope: !49, file: !32, line: 776, baseType: !54, flags: DIFlagStaticMember)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_count_sem", scope: !49, file: !32, line: 777, baseType: !150, flags: DIFlagStaticMember)
!150 = !DICompositeType(tag: DW_TAG_class_type, name: "Semaphore", scope: !152, file: !151, line: 25, size: 192, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7ChibiOS9SemaphoreE")
!151 = !DIFile(filename: "../../libraries/AP_HAL_ChibiOS/Semaphores.h", directory: "/workdisk/akul/fire/fin/ardupilot/build/Pixhawk6C")
!152 = !DINamespace(name: "ChibiOS", scope: null)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_var_info", scope: !49, file: !32, line: 778, baseType: !154, flags: DIFlagStaticMember)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Info", scope: !49, file: !32, line: 210, size: 160, flags: DIFlagTypePassByValue, elements: !157, identifier: "_ZTSN8AP_Param4InfoE")
!157 = !{!158, !159, !160, !173, !174, !175}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !32, line: 211, baseType: !138, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !156, file: !32, line: 212, baseType: !100, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !156, file: !32, line: 213, baseType: !161, size: 32, offset: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !156, file: !32, line: 213, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !162, identifier: "_ZTSN8AP_Param4InfoUt_E")
!162 = !{!163, !165, !167, !169}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "group_info", scope: !161, file: !32, line: 214, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "group_info_ptr", scope: !161, file: !32, line: 215, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "def_value", scope: !161, file: !32, line: 216, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "def_value_offset", scope: !161, file: !32, line: 217, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !171, line: 35, baseType: !172)
!171 = !DIFile(filename: "dev2/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/workdisk/akul/fire")
!172 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !156, file: !32, line: 219, baseType: !54, size: 16, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !156, file: !32, line: 220, baseType: !54, size: 16, offset: 112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !32, line: 221, baseType: !61, size: 8, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_num_vars_base", scope: !49, file: !32, line: 782, baseType: !54, flags: DIFlagStaticMember)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_var_info_dynamic", scope: !49, file: !32, line: 783, baseType: !178, flags: DIFlagStaticMember)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_dynamic_table_sizes", scope: !49, file: !32, line: 787, baseType: !180, flags: DIFlagStaticMember)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 80, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 10)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "param_overrides", scope: !49, file: !32, line: 803, baseType: !184, flags: DIFlagStaticMember)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "param_override", scope: !49, file: !32, line: 798, size: 96, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param14param_overrideE")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "num_param_overrides", scope: !49, file: !32, line: 804, baseType: !54, flags: DIFlagStaticMember)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "param_overrides_len", scope: !49, file: !32, line: 805, baseType: !54, flags: DIFlagStaticMember)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "num_read_only", scope: !49, file: !32, line: 806, baseType: !54, flags: DIFlagStaticMember)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "k_EEPROM_magic0", scope: !49, file: !32, line: 809, baseType: !60, flags: DIFlagStaticMember, extraData: i8 80)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "k_EEPROM_magic1", scope: !49, file: !32, line: 810, baseType: !60, flags: DIFlagStaticMember, extraData: i8 65)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "k_EEPROM_revision", scope: !49, file: !32, line: 811, baseType: !60, flags: DIFlagStaticMember, extraData: i8 6)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_hide_disabled_groups", scope: !49, file: !32, line: 813, baseType: !8, flags: DIFlagStaticMember)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "save_queue", scope: !49, file: !32, line: 821, baseType: !194, flags: DIFlagStaticMember)
!194 = !DICompositeType(tag: DW_TAG_class_type, name: "ObjectBuffer_TS<AP_Param::param_save>", file: !195, line: 284, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS15ObjectBuffer_TSIN8AP_Param10param_saveEE")
!195 = !DIFile(filename: "../../libraries/AP_HAL/utility/RingBuffer.h", directory: "/workdisk/akul/fire/fin/ardupilot/build/Pixhawk6C")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "registered_save_handler", scope: !49, file: !32, line: 822, baseType: !8, flags: DIFlagStaticMember)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "default_list", scope: !49, file: !32, line: 833, baseType: !198, flags: DIFlagStaticMember)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "defaults_list", scope: !49, file: !32, line: 828, size: 96, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param13defaults_listE")
!200 = !DISubprogram(name: "setup", linkageName: "_ZN8AP_Param5setupEv", scope: !49, file: !32, line: 239, type: !19, scopeLine: 239, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!201 = !DISubprogram(name: "AP_Param", scope: !49, file: !32, line: 242, type: !202, scopeLine: 242, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !204, !154}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!205 = !DISubprogram(name: "AP_Param", scope: !49, file: !32, line: 258, type: !206, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !204}
!208 = !DISubprogram(name: "initialised", linkageName: "_ZN8AP_Param11initialisedEv", scope: !49, file: !32, line: 277, type: !19, scopeLine: 277, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!209 = !DISubprogram(name: "group_id", linkageName: "_ZN8AP_Param8group_idEPKNS_9GroupInfoEjhh", scope: !49, file: !32, line: 285, type: !210, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!210 = !DISubroutineType(types: !211)
!211 = !{!112, !164, !112, !61, !61}
!212 = !DISubprogram(name: "copy_name_info", linkageName: "_ZNK8AP_Param14copy_name_infoEPKNS_4InfoEPKNS_9GroupInfoERKNS_12GroupNestingEhPcjb", scope: !49, file: !32, line: 299, type: !213, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215, !154, !164, !217, !61, !220, !93, !8}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!217 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "GroupNesting", scope: !49, file: !32, line: 270, size: 96, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param12GroupNestingE")
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!221 = !DISubprogram(name: "copy_name_token", linkageName: "_ZNK8AP_Param15copy_name_tokenERKNS_10ParamTokenEPcjb", scope: !49, file: !32, line: 308, type: !222, scopeLine: 308, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !215, !224, !220, !93, !8}
!224 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParamToken", scope: !49, file: !32, line: 266, baseType: !227)
!227 = !DICompositeType(tag: DW_TAG_structure_type, scope: !49, file: !32, line: 261, size: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param10ParamTokenE")
!228 = !DISubprogram(name: "find", linkageName: "_ZN8AP_Param4findEPKcP11ap_var_typePt", scope: !49, file: !32, line: 319, type: !229, scopeLine: 319, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!229 = !DISubroutineType(types: !230)
!230 = !{!52, !138, !231, !232}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!233 = !DISubprogram(name: "set_default_by_name", linkageName: "_ZN8AP_Param19set_default_by_nameEPKcf", scope: !49, file: !32, line: 326, type: !234, scopeLine: 326, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{!8, !138, !117}
!236 = !DISubprogram(name: "set_defaults_from_table", linkageName: "_ZN8AP_Param23set_defaults_from_tableEPKNS_21defaults_table_structEh", scope: !49, file: !32, line: 332, type: !237, scopeLine: 332, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !239, !61}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "defaults_table_struct", scope: !49, file: !32, line: 231, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param21defaults_table_structE")
!242 = !DISubprogram(name: "set_by_name", linkageName: "_ZN8AP_Param11set_by_nameEPKcf", scope: !49, file: !32, line: 339, type: !234, scopeLine: 339, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!243 = !DISubprogram(name: "get", linkageName: "_ZN8AP_Param3getEPKcRf", scope: !49, file: !32, line: 346, type: !244, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!244 = !DISubroutineType(types: !245)
!245 = !{!8, !138, !246}
!246 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !117, size: 32)
!247 = !DISubprogram(name: "set_and_save_by_name", linkageName: "_ZN8AP_Param20set_and_save_by_nameEPKcf", scope: !49, file: !32, line: 353, type: !234, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!248 = !DISubprogram(name: "set_and_save_by_name_ifchanged", linkageName: "_ZN8AP_Param30set_and_save_by_name_ifchangedEPKcf", scope: !49, file: !32, line: 354, type: !234, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!249 = !DISubprogram(name: "find_by_index", linkageName: "_ZN8AP_Param13find_by_indexEtP11ap_var_typePNS_10ParamTokenE", scope: !49, file: !32, line: 363, type: !250, scopeLine: 363, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{!52, !54, !231, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!253 = !DISubprogram(name: "find_by_name", linkageName: "_ZN8AP_Param12find_by_nameEPKcP11ap_var_typePNS_10ParamTokenE", scope: !49, file: !32, line: 366, type: !254, scopeLine: 366, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!254 = !DISubroutineType(types: !255)
!255 = !{!52, !138, !231, !252}
!256 = !DISubprogram(name: "find_key_by_pointer_group", linkageName: "_ZN8AP_Param25find_key_by_pointer_groupEPKvtPKNS_9GroupInfoEiRt", scope: !49, file: !32, line: 373, type: !257, scopeLine: 373, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!257 = !DISubroutineType(types: !258)
!258 = !{!8, !100, !54, !164, !170, !259}
!259 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !54, size: 32)
!260 = !DISubprogram(name: "find_key_by_pointer", linkageName: "_ZN8AP_Param19find_key_by_pointerEPKvRt", scope: !49, file: !32, line: 375, type: !261, scopeLine: 375, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!261 = !DISubroutineType(types: !262)
!262 = !{!8, !100, !259}
!263 = !DISubprogram(name: "find_top_level_key_by_pointer", linkageName: "_ZN8AP_Param29find_top_level_key_by_pointerEPKvRt", scope: !49, file: !32, line: 382, type: !261, scopeLine: 382, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!264 = !DISubprogram(name: "find_object", linkageName: "_ZN8AP_Param11find_objectEPKc", scope: !49, file: !32, line: 391, type: !265, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!265 = !DISubroutineType(types: !266)
!266 = !{!52, !138}
!267 = !DISubprogram(name: "notify", linkageName: "_ZNK8AP_Param6notifyEv", scope: !49, file: !32, line: 395, type: !268, scopeLine: 395, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !215}
!270 = !DISubprogram(name: "save_sync", linkageName: "_ZN8AP_Param9save_syncEbb", scope: !49, file: !32, line: 403, type: !271, scopeLine: 403, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !204, !8, !8}
!273 = !DISubprogram(name: "flush", linkageName: "_ZN8AP_Param5flushEv", scope: !49, file: !32, line: 407, type: !16, scopeLine: 407, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!274 = !DISubprogram(name: "save", linkageName: "_ZN8AP_Param4saveEb", scope: !49, file: !32, line: 413, type: !275, scopeLine: 413, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !204, !8}
!277 = !DISubprogram(name: "load", linkageName: "_ZN8AP_Param4loadEv", scope: !49, file: !32, line: 419, type: !278, scopeLine: 419, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!278 = !DISubroutineType(types: !279)
!279 = !{!8, !204}
!280 = !DISubprogram(name: "load_all", linkageName: "_ZN8AP_Param8load_allEv", scope: !49, file: !32, line: 429, type: !19, scopeLine: 429, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!281 = !DISubprogram(name: "storage_used", linkageName: "_ZN8AP_Param12storage_usedEv", scope: !49, file: !32, line: 432, type: !282, scopeLine: 432, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!282 = !DISubroutineType(types: !283)
!283 = !{!54}
!284 = !DISubprogram(name: "storage_size", linkageName: "_ZN8AP_Param12storage_sizeEv", scope: !49, file: !32, line: 435, type: !282, scopeLine: 435, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!285 = !DISubprogram(name: "reload_defaults_file", linkageName: "_ZN8AP_Param20reload_defaults_fileEb", scope: !49, file: !32, line: 439, type: !286, scopeLine: 439, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !8}
!288 = !DISubprogram(name: "load_object_from_eeprom", linkageName: "_ZN8AP_Param23load_object_from_eepromEPKvPKNS_9GroupInfoE", scope: !49, file: !32, line: 441, type: !289, scopeLine: 441, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !100, !164}
!291 = !DISubprogram(name: "set_value", linkageName: "_ZN8AP_Param9set_valueE11ap_var_typePvf", scope: !49, file: !32, line: 444, type: !292, scopeLine: 444, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !31, !92, !117}
!294 = !DISubprogram(name: "set_float", linkageName: "_ZN8AP_Param9set_floatEf11ap_var_type", scope: !49, file: !32, line: 449, type: !295, scopeLine: 449, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !204, !117, !31}
!297 = !DISubprogram(name: "setup_object_defaults", linkageName: "_ZN8AP_Param21setup_object_defaultsEPKvPKNS_9GroupInfoE", scope: !49, file: !32, line: 452, type: !289, scopeLine: 452, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!298 = !DISubprogram(name: "set_object_value", linkageName: "_ZN8AP_Param16set_object_valueEPKvPKNS_9GroupInfoEPKcf", scope: !49, file: !32, line: 457, type: !299, scopeLine: 457, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!299 = !DISubroutineType(types: !300)
!300 = !{!8, !100, !164, !138, !117}
!301 = !DISubprogram(name: "setup_sketch_defaults", linkageName: "_ZN8AP_Param21setup_sketch_defaultsEv", scope: !49, file: !32, line: 463, type: !16, scopeLine: 463, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!302 = !DISubprogram(name: "find_old_parameter", linkageName: "_ZN8AP_Param18find_old_parameterEPKNS_14ConversionInfoEPS_", scope: !49, file: !32, line: 466, type: !303, scopeLine: 466, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!303 = !DISubroutineType(types: !304)
!304 = !{!8, !305, !52}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConversionInfo", scope: !49, file: !32, line: 223, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTSN8AP_Param14ConversionInfoE")
!308 = !DISubprogram(name: "convert_old_parameters", linkageName: "_ZN8AP_Param22convert_old_parametersEPKNS_14ConversionInfoEhh", scope: !49, file: !32, line: 469, type: !309, scopeLine: 469, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !305, !61, !61}
!311 = !DISubprogram(name: "convert_old_parameters_scaled", linkageName: "_ZN8AP_Param29convert_old_parameters_scaledEPKNS_14ConversionInfoEhfh", scope: !49, file: !32, line: 471, type: !312, scopeLine: 471, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !305, !61, !117, !61}
!314 = !DISubprogram(name: "convert_parameter_width", linkageName: "_ZN8AP_Param23convert_parameter_widthE11ap_var_typef", scope: !49, file: !32, line: 478, type: !315, scopeLine: 478, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!315 = !DISubroutineType(types: !316)
!316 = !{!8, !204, !31, !117}
!317 = !DISubprogram(name: "convert_centi_parameter", linkageName: "_ZN8AP_Param23convert_centi_parameterE11ap_var_type", scope: !49, file: !32, line: 479, type: !318, scopeLine: 479, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!318 = !DISubroutineType(types: !319)
!319 = !{!8, !204, !31}
!320 = !DISubprogram(name: "convert_old_parameter", linkageName: "_ZN8AP_Param21convert_old_parameterEPKNS_14ConversionInfoEfh", scope: !49, file: !32, line: 488, type: !321, scopeLine: 488, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !305, !117, !61}
!323 = !DISubprogram(name: "convert_class", linkageName: "_ZN8AP_Param13convert_classEtPvPKNS_9GroupInfoEttb", scope: !49, file: !32, line: 492, type: !324, scopeLine: 492, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !54, !92, !164, !54, !54, !8}
!326 = !DISubprogram(name: "get_param_by_index", linkageName: "_ZN8AP_Param18get_param_by_indexEPvh11ap_var_typeS0_", scope: !49, file: !32, line: 501, type: !327, scopeLine: 501, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!327 = !DISubroutineType(types: !328)
!328 = !{!8, !92, !61, !31, !92}
!329 = !DISubprogram(name: "erase_all", linkageName: "_ZN8AP_Param9erase_allEv", scope: !49, file: !32, line: 505, type: !16, scopeLine: 505, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!330 = !DISubprogram(name: "first", linkageName: "_ZN8AP_Param5firstEPNS_10ParamTokenEP11ap_var_typePf", scope: !49, file: !32, line: 512, type: !331, scopeLine: 512, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!331 = !DISubroutineType(types: !332)
!332 = !{!52, !252, !231, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!334 = !DISubprogram(name: "next", linkageName: "_ZN8AP_Param4nextEPNS_10ParamTokenEP11ap_var_type", scope: !49, file: !32, line: 516, type: !335, scopeLine: 516, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!335 = !DISubroutineType(types: !336)
!336 = !{!52, !252, !231}
!337 = !DISubprogram(name: "next", linkageName: "_ZN8AP_Param4nextEPNS_10ParamTokenEP11ap_var_typebPf", scope: !49, file: !32, line: 517, type: !338, scopeLine: 517, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!338 = !DISubroutineType(types: !339)
!339 = !{!52, !252, !231, !8, !333}
!340 = !DISubprogram(name: "next_scalar", linkageName: "_ZN8AP_Param11next_scalarEPNS_10ParamTokenEP11ap_var_typePf", scope: !49, file: !32, line: 521, type: !331, scopeLine: 521, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!341 = !DISubprogram(name: "type_size", linkageName: "_ZN8AP_Param9type_sizeE11ap_var_type", scope: !49, file: !32, line: 524, type: !342, scopeLine: 524, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!342 = !DISubroutineType(types: !343)
!343 = !{!61, !31}
!344 = !DISubprogram(name: "cast_to_float", linkageName: "_ZNK8AP_Param13cast_to_floatE11ap_var_type", scope: !49, file: !32, line: 527, type: !345, scopeLine: 527, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!345 = !DISubroutineType(types: !346)
!346 = !{!117, !215, !31}
!347 = !DISubprogram(name: "check_var_info", linkageName: "_ZN8AP_Param14check_var_infoEv", scope: !49, file: !32, line: 530, type: !16, scopeLine: 530, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!348 = !DISubprogram(name: "configured", linkageName: "_ZNK8AP_Param10configuredEv", scope: !49, file: !32, line: 533, type: !349, scopeLine: 533, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!349 = !DISubroutineType(types: !350)
!350 = !{!8, !215}
!351 = !DISubprogram(name: "is_read_only", linkageName: "_ZNK8AP_Param12is_read_onlyEv", scope: !49, file: !32, line: 536, type: !349, scopeLine: 536, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!352 = !DISubprogram(name: "get_persistent_key", linkageName: "_ZN8AP_Param18get_persistent_keyEt", scope: !49, file: !32, line: 539, type: !353, scopeLine: 539, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!353 = !DISubroutineType(types: !354)
!354 = !{!54, !54}
!355 = !DISubprogram(name: "count_parameters", linkageName: "_ZN8AP_Param16count_parametersEv", scope: !49, file: !32, line: 542, type: !282, scopeLine: 542, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!356 = !DISubprogram(name: "invalidate_count", linkageName: "_ZN8AP_Param16invalidate_countEv", scope: !49, file: !32, line: 545, type: !16, scopeLine: 545, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!357 = !DISubprogram(name: "set_hide_disabled_groups", linkageName: "_ZN8AP_Param24set_hide_disabled_groupsEb", scope: !49, file: !32, line: 547, type: !286, scopeLine: 547, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!358 = !DISubprogram(name: "set_frame_type_flags", linkageName: "_ZN8AP_Param20set_frame_type_flagsEt", scope: !49, file: !32, line: 550, type: !359, scopeLine: 550, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !54}
!361 = !DISubprogram(name: "check_frame_type", linkageName: "_ZN8AP_Param16check_frame_typeEt", scope: !49, file: !32, line: 556, type: !362, scopeLine: 556, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!362 = !DISubroutineType(types: !363)
!363 = !{!8, !54}
!364 = !DISubprogram(name: "get_singleton", linkageName: "_ZN8AP_Param13get_singletonEv", scope: !49, file: !32, line: 575, type: !365, scopeLine: 575, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!365 = !DISubroutineType(types: !366)
!366 = !{!52}
!367 = !DISubprogram(name: "add_table", linkageName: "_ZN8AP_Param9add_tableEhPKch", scope: !49, file: !32, line: 579, type: !368, scopeLine: 579, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!368 = !DISubroutineType(types: !369)
!369 = !{!8, !61, !138, !61}
!370 = !DISubprogram(name: "add_param", linkageName: "_ZN8AP_Param9add_paramEhhPKcf", scope: !49, file: !32, line: 580, type: !371, scopeLine: 580, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!371 = !DISubroutineType(types: !372)
!372 = !{!8, !61, !61, !138, !117}
!373 = !DISubprogram(name: "load_int32", linkageName: "_ZN8AP_Param10load_int32EtjRi", scope: !49, file: !32, line: 581, type: !374, scopeLine: 581, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!374 = !DISubroutineType(types: !375)
!375 = !{!8, !54, !112, !376}
!376 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !55, line: 44, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 77, baseType: !172)
!379 = !DISubprogram(name: "load_defaults_file", linkageName: "_ZN8AP_Param18load_defaults_fileEPKcb", scope: !49, file: !32, line: 584, type: !380, scopeLine: 584, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!380 = !DISubroutineType(types: !381)
!381 = !{!8, !138, !8}
!382 = !DISubprogram(name: "add_default", linkageName: "_ZN8AP_Param11add_defaultEPS_f", scope: !49, file: !32, line: 589, type: !383, scopeLine: 589, flags: DIFlagProtected | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !52, !117}
!385 = !DISubprogram(name: "check_group_info", linkageName: "_ZN8AP_Param16check_group_infoEPKNS_9GroupInfoEPthh", scope: !49, file: !32, line: 659, type: !386, scopeLine: 659, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !164, !232, !61, !61}
!388 = !DISubprogram(name: "duplicate_key", linkageName: "_ZN8AP_Param13duplicate_keyEtt", scope: !49, file: !32, line: 661, type: !389, scopeLine: 661, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!389 = !DISubroutineType(types: !390)
!390 = !{!8, !54, !54}
!391 = !DISubprogram(name: "adjust_group_offset", linkageName: "_ZN8AP_Param19adjust_group_offsetEtRKNS_9GroupInfoERi", scope: !49, file: !32, line: 663, type: !392, scopeLine: 663, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!392 = !DISubroutineType(types: !393)
!393 = !{!8, !54, !394, !395}
!394 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !47, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !170, size: 32)
!396 = !DISubprogram(name: "get_base", linkageName: "_ZN8AP_Param8get_baseERKNS_4InfoERi", scope: !49, file: !32, line: 664, type: !397, scopeLine: 664, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!397 = !DISubroutineType(types: !398)
!398 = !{!8, !399, !395}
!399 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !155, size: 32)
!400 = !DISubprogram(name: "get_group_info", linkageName: "_ZN8AP_Param14get_group_infoERKNS_9GroupInfoE", scope: !49, file: !32, line: 667, type: !401, scopeLine: 667, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!401 = !DISubroutineType(types: !402)
!402 = !{!164, !394}
!403 = !DISubprogram(name: "get_group_info", linkageName: "_ZN8AP_Param14get_group_infoERKNS_4InfoE", scope: !49, file: !32, line: 670, type: !404, scopeLine: 670, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!404 = !DISubroutineType(types: !405)
!405 = !{!164, !399}
!406 = !DISubprogram(name: "find_var_info_group", linkageName: "_ZNK8AP_Param19find_var_info_groupEPKNS_9GroupInfoEtjhiPjRS2_RNS_12GroupNestingEPh", scope: !49, file: !32, line: 672, type: !407, scopeLine: 672, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!407 = !DISubroutineType(types: !408)
!408 = !{!154, !215, !164, !54, !112, !61, !170, !409, !410, !411, !412}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !164, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !219, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!413 = !DISubprogram(name: "find_var_info", linkageName: "_ZNK8AP_Param13find_var_infoEPjRPKNS_9GroupInfoERNS_12GroupNestingEPh", scope: !49, file: !32, line: 682, type: !414, scopeLine: 682, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!414 = !DISubroutineType(types: !415)
!415 = !{!154, !215, !409, !410, !411, !412}
!416 = !DISubprogram(name: "find_var_info_token", linkageName: "_ZNK8AP_Param19find_var_info_tokenERKNS_10ParamTokenEPjRPKNS_9GroupInfoERNS_12GroupNestingEPh", scope: !49, file: !32, line: 687, type: !417, scopeLine: 687, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!417 = !DISubroutineType(types: !418)
!418 = !{!154, !215, !224, !409, !410, !411, !412}
!419 = !DISubprogram(name: "find_by_header_group", linkageName: "_ZN8AP_Param20find_by_header_groupENS_12Param_headerEPPvtPKNS_9GroupInfoEjhi", scope: !49, file: !32, line: 692, type: !420, scopeLine: 692, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!420 = !DISubroutineType(types: !421)
!421 = !{!154, !422, !428, !54, !164, !112, !61, !170}
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Param_header", scope: !49, file: !32, line: 620, size: 32, flags: DIFlagTypePassByValue, elements: !423, identifier: "_ZTSN8AP_Param12Param_headerE")
!423 = !{!424, !425, !426, !427}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "key_low", scope: !422, file: !32, line: 622, baseType: !112, size: 8, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !422, file: !32, line: 623, baseType: !112, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "key_high", scope: !422, file: !32, line: 624, baseType: !112, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "group_element", scope: !422, file: !32, line: 625, baseType: !112, size: 18, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!429 = !DISubprogram(name: "find_by_header", linkageName: "_ZN8AP_Param14find_by_headerENS_12Param_headerEPPv", scope: !49, file: !32, line: 699, type: !430, scopeLine: 699, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!430 = !DISubroutineType(types: !431)
!431 = !{!154, !422, !428}
!432 = !DISubprogram(name: "add_vector3f_suffix", linkageName: "_ZNK8AP_Param19add_vector3f_suffixEPcjh", scope: !49, file: !32, line: 702, type: !433, scopeLine: 702, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !215, !220, !93, !61}
!435 = !DISubprogram(name: "find_group", linkageName: "_ZN8AP_Param10find_groupEPKctiPKNS_9GroupInfoEP11ap_var_type", scope: !49, file: !32, line: 706, type: !436, scopeLine: 706, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!436 = !DISubroutineType(types: !437)
!437 = !{!52, !138, !54, !170, !164, !231}
!438 = !DISubprogram(name: "write_sentinal", linkageName: "_ZN8AP_Param14write_sentinalEt", scope: !49, file: !32, line: 712, type: !359, scopeLine: 712, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!439 = !DISubprogram(name: "get_key", linkageName: "_ZN8AP_Param7get_keyERKNS_12Param_headerE", scope: !49, file: !32, line: 713, type: !440, scopeLine: 713, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!440 = !DISubroutineType(types: !441)
!441 = !{!54, !442}
!442 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!444 = !DISubprogram(name: "set_key", linkageName: "_ZN8AP_Param7set_keyERNS_12Param_headerEt", scope: !49, file: !32, line: 714, type: !445, scopeLine: 714, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !447, !54}
!447 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !422, size: 32)
!448 = !DISubprogram(name: "is_sentinal", linkageName: "_ZN8AP_Param11is_sentinalERKNS_12Param_headerE", scope: !49, file: !32, line: 715, type: !449, scopeLine: 715, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!449 = !DISubroutineType(types: !450)
!450 = !{!8, !442}
!451 = !DISubprogram(name: "scan", linkageName: "_ZN8AP_Param4scanEPKNS_12Param_headerEPt", scope: !49, file: !32, line: 716, type: !452, scopeLine: 716, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!452 = !DISubroutineType(types: !453)
!453 = !{!8, !454, !232}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!455 = !DISubprogram(name: "eeprom_write_check", linkageName: "_ZN8AP_Param18eeprom_write_checkEPKvth", scope: !49, file: !32, line: 719, type: !456, scopeLine: 719, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !100, !54, !61}
!458 = !DISubprogram(name: "next_group", linkageName: "_ZN8AP_Param10next_groupEtPKNS_9GroupInfoEPbjhiPNS_10ParamTokenEP11ap_var_typebPf", scope: !49, file: !32, line: 723, type: !459, scopeLine: 723, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!459 = !DISubroutineType(types: !460)
!460 = !{!52, !66, !164, !461, !462, !60, !463, !252, !231, !8, !333}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!464 = !DISubprogram(name: "get_default_value", linkageName: "_ZN8AP_Param17get_default_valueEPKS_RKNS_9GroupInfoE", scope: !49, file: !32, line: 736, type: !465, scopeLine: 736, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!465 = !DISubroutineType(types: !466)
!466 = !{!117, !467, !394}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!468 = !DISubprogram(name: "get_default_value", linkageName: "_ZN8AP_Param17get_default_valueEPKS_RKNS_4InfoE", scope: !49, file: !32, line: 737, type: !469, scopeLine: 737, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!469 = !DISubroutineType(types: !470)
!470 = !{!117, !467, !399}
!471 = !DISubprogram(name: "parse_param_line", linkageName: "_ZN8AP_Param16parse_param_lineEPcPS0_RfRb", scope: !49, file: !32, line: 739, type: !472, scopeLine: 739, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!472 = !DISubroutineType(types: !473)
!473 = !{!8, !220, !474, !246, !475}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8, size: 32)
!476 = !DISubprogram(name: "count_defaults_in_file", linkageName: "_ZN8AP_Param22count_defaults_in_fileEPKcRt", scope: !49, file: !32, line: 744, type: !477, scopeLine: 744, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!477 = !DISubroutineType(types: !478)
!478 = !{!8, !138, !259}
!479 = !DISubprogram(name: "count_param_defaults", linkageName: "_ZN8AP_Param20count_param_defaultsEPVKciRt", scope: !49, file: !32, line: 745, type: !480, scopeLine: 745, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!480 = !DISubroutineType(types: !481)
!481 = !{!8, !482, !377, !259}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !140)
!485 = !DISubprogram(name: "read_param_defaults_file", linkageName: "_ZN8AP_Param24read_param_defaults_fileEPKcbRt", scope: !49, file: !32, line: 746, type: !486, scopeLine: 746, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!486 = !DISubroutineType(types: !487)
!487 = !{!8, !138, !8, !259}
!488 = !DISubprogram(name: "load_defaults_file_from_filesystem", linkageName: "_ZN8AP_Param34load_defaults_file_from_filesystemEPKcb", scope: !49, file: !32, line: 749, type: !489, scopeLine: 749, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !138, !8}
!491 = !DISubprogram(name: "load_defaults_file_from_romfs", linkageName: "_ZN8AP_Param29load_defaults_file_from_romfsEPKcb", scope: !49, file: !32, line: 751, type: !489, scopeLine: 751, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!492 = !DISubprogram(name: "load_param_defaults", linkageName: "_ZN8AP_Param19load_param_defaultsEPVKcib", scope: !49, file: !32, line: 754, type: !493, scopeLine: 754, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !482, !377, !8}
!495 = !DISubprogram(name: "count_embedded_param_defaults", linkageName: "_ZN8AP_Param29count_embedded_param_defaultsERt", scope: !49, file: !32, line: 759, type: !496, scopeLine: 759, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!496 = !DISubroutineType(types: !497)
!497 = !{!8, !259}
!498 = !DISubprogram(name: "load_embedded_param_defaults", linkageName: "_ZN8AP_Param28load_embedded_param_defaultsEb", scope: !49, file: !32, line: 760, type: !286, scopeLine: 760, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!499 = !DISubprogram(name: "configured_in_defaults_file", linkageName: "_ZNK8AP_Param27configured_in_defaults_fileERb", scope: !49, file: !32, line: 763, type: !500, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!500 = !DISubroutineType(types: !501)
!501 = !{!8, !215, !475}
!502 = !DISubprogram(name: "configured_in_storage", linkageName: "_ZNK8AP_Param21configured_in_storageEv", scope: !49, file: !32, line: 766, type: !349, scopeLine: 766, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!503 = !DISubprogram(name: "send_parameter", linkageName: "_ZNK8AP_Param14send_parameterEPKc11ap_var_typeh", scope: !49, file: !32, line: 769, type: !504, scopeLine: 769, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !215, !138, !31, !61}
!506 = !DISubprogram(name: "var_info", linkageName: "_ZN8AP_Param8var_infoEt", scope: !49, file: !32, line: 784, type: !507, scopeLine: 784, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!507 = !DISubroutineType(types: !508)
!508 = !{!399, !54}
!509 = !DISubprogram(name: "save_io_handler", linkageName: "_ZN8AP_Param15save_io_handlerEv", scope: !49, file: !32, line: 825, type: !206, scopeLine: 825, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!510 = !DISubprogram(name: "check_default", linkageName: "_ZN8AP_Param13check_defaultEPS_Pf", scope: !49, file: !32, line: 834, type: !511, scopeLine: 834, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !52, !333}
!513 = !{!514}
!514 = !DISubrange(count: -1)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "var_info2", scope: !43, file: !42, line: 41, baseType: !46, flags: DIFlagPublic | DIFlagStaticMember)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "num_cores", scope: !43, file: !42, line: 369, baseType: !61, size: 8)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !43, file: !42, line: 370, baseType: !61, size: 8, offset: 8)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !43, file: !42, line: 371, baseType: !519, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = !DICompositeType(tag: DW_TAG_class_type, name: "NavEKF3_core", file: !42, line: 28, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS12NavEKF3_core")
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_frameTimeUsec", scope: !43, file: !42, line: 373, baseType: !112, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_framesPerPrediction", scope: !43, file: !42, line: 374, baseType: !61, size: 8, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_enable", scope: !43, file: !42, line: 385, baseType: !524, size: 8, offset: 104)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "AP_Int8", file: !32, line: 1029, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_ParamT<signed char, AP_PARAM_INT8>", file: !32, line: 850, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !526, templateParams: !553, identifier: "_ZTS9AP_ParamTIaL11ap_var_type1EE")
!526 = !{!527, !528, !530, !532, !539, !543, !544, !545, !546, !547, !548, !549, !550}
!527 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !525, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !525, file: !32, line: 853, baseType: !529, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !525, file: !32, line: 906, baseType: !531, size: 8, flags: DIFlagProtected)
!531 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!532 = !DISubprogram(name: "get", linkageName: "_ZNK9AP_ParamTIaL11ap_var_type1EE3getEv", scope: !525, file: !32, line: 857, type: !533, scopeLine: 857, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!533 = !DISubroutineType(types: !534)
!534 = !{!535, !537}
!535 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!539 = !DISubprogram(name: "set", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE3setERKa", scope: !525, file: !32, line: 863, type: !540, scopeLine: 863, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !542, !535}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!543 = !DISubprogram(name: "set_enable", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE10set_enableERKa", scope: !525, file: !32, line: 868, type: !540, scopeLine: 868, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!544 = !DISubprogram(name: "set_default", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE11set_defaultERKa", scope: !525, file: !32, line: 872, type: !540, scopeLine: 872, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!545 = !DISubprogram(name: "set_and_default", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE15set_and_defaultERKa", scope: !525, file: !32, line: 876, type: !540, scopeLine: 876, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!546 = !DISubprogram(name: "set_and_notify", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE14set_and_notifyERKa", scope: !525, file: !32, line: 880, type: !540, scopeLine: 880, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!547 = !DISubprogram(name: "set_and_save", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE12set_and_saveERKa", scope: !525, file: !32, line: 884, type: !540, scopeLine: 884, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!548 = !DISubprogram(name: "set_and_save_ifchanged", linkageName: "_ZN9AP_ParamTIaL11ap_var_type1EE22set_and_save_ifchangedERKa", scope: !525, file: !32, line: 891, type: !540, scopeLine: 891, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!549 = !DISubprogram(name: "operator const signed char &", linkageName: "_ZNK9AP_ParamTIaL11ap_var_type1EEcvRKaEv", scope: !525, file: !32, line: 897, type: !533, scopeLine: 897, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!550 = !DISubprogram(name: "cast_to_float", linkageName: "_ZNK9AP_ParamTIaL11ap_var_type1EE13cast_to_floatEv", scope: !525, file: !32, line: 903, type: !551, scopeLine: 903, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!551 = !DISubroutineType(types: !552)
!552 = !{!117, !537}
!553 = !{!554, !555}
!554 = !DITemplateTypeParameter(name: "T", type: !531)
!555 = !DITemplateValueParameter(name: "PT", type: !31, value: i32 1)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsHorizVelNoise", scope: !43, file: !42, line: 386, baseType: !557, size: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "AP_Float", file: !32, line: 1028, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_ParamT<float, AP_PARAM_FLOAT>", file: !32, line: 850, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !559, templateParams: !583, identifier: "_ZTS9AP_ParamTIfL11ap_var_type4EE")
!559 = !{!560, !561, !562, !563, !569, !573, !574, !575, !576, !577, !578, !579, !580}
!560 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !558, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !558, file: !32, line: 853, baseType: !529, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !558, file: !32, line: 906, baseType: !117, size: 32, flags: DIFlagProtected)
!563 = !DISubprogram(name: "get", linkageName: "_ZNK9AP_ParamTIfL11ap_var_type4EE3getEv", scope: !558, file: !32, line: 857, type: !564, scopeLine: 857, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!564 = !DISubroutineType(types: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !168, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!569 = !DISubprogram(name: "set", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE3setERKf", scope: !558, file: !32, line: 863, type: !570, scopeLine: 863, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !572, !566}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!573 = !DISubprogram(name: "set_enable", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE10set_enableERKf", scope: !558, file: !32, line: 868, type: !570, scopeLine: 868, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!574 = !DISubprogram(name: "set_default", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE11set_defaultERKf", scope: !558, file: !32, line: 872, type: !570, scopeLine: 872, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!575 = !DISubprogram(name: "set_and_default", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE15set_and_defaultERKf", scope: !558, file: !32, line: 876, type: !570, scopeLine: 876, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!576 = !DISubprogram(name: "set_and_notify", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE14set_and_notifyERKf", scope: !558, file: !32, line: 880, type: !570, scopeLine: 880, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!577 = !DISubprogram(name: "set_and_save", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE12set_and_saveERKf", scope: !558, file: !32, line: 884, type: !570, scopeLine: 884, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!578 = !DISubprogram(name: "set_and_save_ifchanged", linkageName: "_ZN9AP_ParamTIfL11ap_var_type4EE22set_and_save_ifchangedERKf", scope: !558, file: !32, line: 891, type: !570, scopeLine: 891, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DISubprogram(name: "operator const float &", linkageName: "_ZNK9AP_ParamTIfL11ap_var_type4EEcvRKfEv", scope: !558, file: !32, line: 897, type: !564, scopeLine: 897, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!580 = !DISubprogram(name: "cast_to_float", linkageName: "_ZNK9AP_ParamTIfL11ap_var_type4EE13cast_to_floatEv", scope: !558, file: !32, line: 903, type: !581, scopeLine: 903, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!581 = !DISubroutineType(types: !582)
!582 = !{!117, !567}
!583 = !{!584, !585}
!584 = !DITemplateTypeParameter(name: "T", type: !117)
!585 = !DITemplateValueParameter(name: "PT", type: !31, value: i32 4)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsVertVelNoise", scope: !43, file: !42, line: 387, baseType: !557, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsHorizPosNoise", scope: !43, file: !42, line: 388, baseType: !557, size: 32, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_baroAltNoise", scope: !43, file: !42, line: 389, baseType: !557, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_magNoise", scope: !43, file: !42, line: 390, baseType: !557, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_easNoise", scope: !43, file: !42, line: 391, baseType: !557, size: 32, offset: 288)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_windVelProcessNoise", scope: !43, file: !42, line: 392, baseType: !557, size: 32, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_wndVarHgtRateScale", scope: !43, file: !42, line: 393, baseType: !557, size: 32, offset: 352)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_magEarthProcessNoise", scope: !43, file: !42, line: 394, baseType: !557, size: 32, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_magBodyProcessNoise", scope: !43, file: !42, line: 395, baseType: !557, size: 32, offset: 416)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_gyrNoise", scope: !43, file: !42, line: 396, baseType: !557, size: 32, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_accNoise", scope: !43, file: !42, line: 397, baseType: !557, size: 32, offset: 480)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_gyroBiasProcessNoise", scope: !43, file: !42, line: 398, baseType: !557, size: 32, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_accelBiasProcessNoise", scope: !43, file: !42, line: 399, baseType: !557, size: 32, offset: 544)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_hgtDelay_ms", scope: !43, file: !42, line: 400, baseType: !600, size: 16, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "AP_Int16", file: !32, line: 1030, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_ParamT<short, AP_PARAM_INT16>", file: !32, line: 850, size: 16, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !602, templateParams: !628, identifier: "_ZTS9AP_ParamTIsL11ap_var_type2EE")
!602 = !{!603, !604, !605, !607, !614, !618, !619, !620, !621, !622, !623, !624, !625}
!603 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !601, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !601, file: !32, line: 853, baseType: !529, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !601, file: !32, line: 906, baseType: !606, size: 16, flags: DIFlagProtected)
!606 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!607 = !DISubprogram(name: "get", linkageName: "_ZNK9AP_ParamTIsL11ap_var_type2EE3getEv", scope: !601, file: !32, line: 857, type: !608, scopeLine: 857, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!608 = !DISubroutineType(types: !609)
!609 = !{!610, !612}
!610 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!614 = !DISubprogram(name: "set", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE3setERKs", scope: !601, file: !32, line: 863, type: !615, scopeLine: 863, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !617, !610}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!618 = !DISubprogram(name: "set_enable", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE10set_enableERKs", scope: !601, file: !32, line: 868, type: !615, scopeLine: 868, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!619 = !DISubprogram(name: "set_default", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE11set_defaultERKs", scope: !601, file: !32, line: 872, type: !615, scopeLine: 872, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!620 = !DISubprogram(name: "set_and_default", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE15set_and_defaultERKs", scope: !601, file: !32, line: 876, type: !615, scopeLine: 876, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!621 = !DISubprogram(name: "set_and_notify", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE14set_and_notifyERKs", scope: !601, file: !32, line: 880, type: !615, scopeLine: 880, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!622 = !DISubprogram(name: "set_and_save", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE12set_and_saveERKs", scope: !601, file: !32, line: 884, type: !615, scopeLine: 884, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!623 = !DISubprogram(name: "set_and_save_ifchanged", linkageName: "_ZN9AP_ParamTIsL11ap_var_type2EE22set_and_save_ifchangedERKs", scope: !601, file: !32, line: 891, type: !615, scopeLine: 891, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!624 = !DISubprogram(name: "operator const short &", linkageName: "_ZNK9AP_ParamTIsL11ap_var_type2EEcvRKsEv", scope: !601, file: !32, line: 897, type: !608, scopeLine: 897, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!625 = !DISubprogram(name: "cast_to_float", linkageName: "_ZNK9AP_ParamTIsL11ap_var_type2EE13cast_to_floatEv", scope: !601, file: !32, line: 903, type: !626, scopeLine: 903, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!626 = !DISubroutineType(types: !627)
!627 = !{!117, !612}
!628 = !{!629, !630}
!629 = !DITemplateTypeParameter(name: "T", type: !606)
!630 = !DITemplateValueParameter(name: "PT", type: !31, value: i32 2)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsVelInnovGate", scope: !43, file: !42, line: 401, baseType: !600, size: 16, offset: 592)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsPosInnovGate", scope: !43, file: !42, line: 402, baseType: !600, size: 16, offset: 608)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_hgtInnovGate", scope: !43, file: !42, line: 403, baseType: !600, size: 16, offset: 624)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_magInnovGate", scope: !43, file: !42, line: 404, baseType: !600, size: 16, offset: 640)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_tasInnovGate", scope: !43, file: !42, line: 405, baseType: !600, size: 16, offset: 656)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_magCal", scope: !43, file: !42, line: 406, baseType: !524, size: 8, offset: 672)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsGlitchRadiusMax", scope: !43, file: !42, line: 407, baseType: !524, size: 8, offset: 680)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_flowNoise", scope: !43, file: !42, line: 408, baseType: !557, size: 32, offset: 704)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_flowInnovGate", scope: !43, file: !42, line: 409, baseType: !600, size: 16, offset: 736)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_flowDelay_ms", scope: !43, file: !42, line: 410, baseType: !524, size: 8, offset: 752)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_rngInnovGate", scope: !43, file: !42, line: 411, baseType: !600, size: 16, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_maxFlowRate", scope: !43, file: !42, line: 412, baseType: !557, size: 32, offset: 800)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_rngNoise", scope: !43, file: !42, line: 413, baseType: !557, size: 32, offset: 832)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsCheck", scope: !43, file: !42, line: 414, baseType: !524, size: 8, offset: 864)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_imuMask", scope: !43, file: !42, line: 415, baseType: !524, size: 8, offset: 872)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsCheckScaler", scope: !43, file: !42, line: 416, baseType: !600, size: 16, offset: 880)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_noaidHorizNoise", scope: !43, file: !42, line: 417, baseType: !557, size: 32, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_yawNoise", scope: !43, file: !42, line: 418, baseType: !557, size: 32, offset: 928)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_yawInnovGate", scope: !43, file: !42, line: 419, baseType: !600, size: 16, offset: 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_tauVelPosOutput", scope: !43, file: !42, line: 420, baseType: !524, size: 8, offset: 976)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_useRngSwHgt", scope: !43, file: !42, line: 421, baseType: !524, size: 8, offset: 984)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_terrGradMax", scope: !43, file: !42, line: 422, baseType: !557, size: 32, offset: 992)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_rngBcnNoise", scope: !43, file: !42, line: 423, baseType: !557, size: 32, offset: 1024)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_rngBcnInnovGate", scope: !43, file: !42, line: 424, baseType: !600, size: 16, offset: 1056)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_rngBcnDelay_ms", scope: !43, file: !42, line: 425, baseType: !524, size: 8, offset: 1072)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_useRngSwSpd", scope: !43, file: !42, line: 426, baseType: !557, size: 32, offset: 1088)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_accBiasLim", scope: !43, file: !42, line: 427, baseType: !557, size: 32, offset: 1120)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_magMask", scope: !43, file: !42, line: 428, baseType: !524, size: 8, offset: 1152)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_originHgtMode", scope: !43, file: !42, line: 429, baseType: !524, size: 8, offset: 1160)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_visOdmVelErrMax", scope: !43, file: !42, line: 430, baseType: !557, size: 32, offset: 1184)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_visOdmVelErrMin", scope: !43, file: !42, line: 431, baseType: !557, size: 32, offset: 1216)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_wencOdmVelErr", scope: !43, file: !42, line: 432, baseType: !557, size: 32, offset: 1248)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_flowUse", scope: !43, file: !42, line: 433, baseType: !524, size: 8, offset: 1280)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_hrt_filt_freq", scope: !43, file: !42, line: 434, baseType: !557, size: 32, offset: 1312)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_mag_ef_limit", scope: !43, file: !42, line: 435, baseType: !600, size: 16, offset: 1344)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_gsfRunMask", scope: !43, file: !42, line: 436, baseType: !524, size: 8, offset: 1360)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_gsfUseMask", scope: !43, file: !42, line: 437, baseType: !524, size: 8, offset: 1368)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_gsfResetMaxCount", scope: !43, file: !42, line: 438, baseType: !524, size: 8, offset: 1376)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_err_thresh", scope: !43, file: !42, line: 439, baseType: !557, size: 32, offset: 1408)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_affinity", scope: !43, file: !42, line: 440, baseType: !671, size: 32, offset: 1440)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "AP_Int32", file: !32, line: 1031, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_ParamT<int, AP_PARAM_INT32>", file: !32, line: 850, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !673, templateParams: !698, identifier: "_ZTS9AP_ParamTIiL11ap_var_type3EE")
!673 = !{!674, !675, !676, !677, !684, !688, !689, !690, !691, !692, !693, !694, !695}
!674 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !672, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !672, file: !32, line: 853, baseType: !529, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 3)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !672, file: !32, line: 906, baseType: !172, size: 32, flags: DIFlagProtected)
!677 = !DISubprogram(name: "get", linkageName: "_ZNK9AP_ParamTIiL11ap_var_type3EE3getEv", scope: !672, file: !32, line: 857, type: !678, scopeLine: 857, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !682}
!680 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!684 = !DISubprogram(name: "set", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE3setERKi", scope: !672, file: !32, line: 863, type: !685, scopeLine: 863, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !687, !680}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!688 = !DISubprogram(name: "set_enable", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE10set_enableERKi", scope: !672, file: !32, line: 868, type: !685, scopeLine: 868, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!689 = !DISubprogram(name: "set_default", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE11set_defaultERKi", scope: !672, file: !32, line: 872, type: !685, scopeLine: 872, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!690 = !DISubprogram(name: "set_and_default", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE15set_and_defaultERKi", scope: !672, file: !32, line: 876, type: !685, scopeLine: 876, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!691 = !DISubprogram(name: "set_and_notify", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE14set_and_notifyERKi", scope: !672, file: !32, line: 880, type: !685, scopeLine: 880, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!692 = !DISubprogram(name: "set_and_save", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE12set_and_saveERKi", scope: !672, file: !32, line: 884, type: !685, scopeLine: 884, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!693 = !DISubprogram(name: "set_and_save_ifchanged", linkageName: "_ZN9AP_ParamTIiL11ap_var_type3EE22set_and_save_ifchangedERKi", scope: !672, file: !32, line: 891, type: !685, scopeLine: 891, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!694 = !DISubprogram(name: "operator const int &", linkageName: "_ZNK9AP_ParamTIiL11ap_var_type3EEcvRKiEv", scope: !672, file: !32, line: 897, type: !678, scopeLine: 897, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!695 = !DISubprogram(name: "cast_to_float", linkageName: "_ZNK9AP_ParamTIiL11ap_var_type3EE13cast_to_floatEv", scope: !672, file: !32, line: 903, type: !696, scopeLine: 903, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!696 = !DISubroutineType(types: !697)
!697 = !{!117, !682}
!698 = !{!699, !700}
!699 = !DITemplateTypeParameter(name: "T", type: !172)
!700 = !DITemplateValueParameter(name: "PT", type: !31, value: i32 3)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_dragObsNoise", scope: !43, file: !42, line: 441, baseType: !557, size: 32, offset: 1472)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_ballisticCoef_x", scope: !43, file: !42, line: 442, baseType: !557, size: 32, offset: 1504)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_ballisticCoef_y", scope: !43, file: !42, line: 443, baseType: !557, size: 32, offset: 1536)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_momentumDragCoef", scope: !43, file: !42, line: 444, baseType: !557, size: 32, offset: 1568)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_betaMask", scope: !43, file: !42, line: 445, baseType: !524, size: 8, offset: 1600)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_ognmTestScaleFactor", scope: !43, file: !42, line: 446, baseType: !557, size: 32, offset: 1632)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_baroGndEffectDeadZone", scope: !43, file: !42, line: 447, baseType: !557, size: 32, offset: 1664)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_primary_core", scope: !43, file: !42, line: 448, baseType: !524, size: 8, offset: 1696)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_log_level", scope: !43, file: !42, line: 449, baseType: !710, size: 8, offset: 1704)
!710 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "AP_Enum<NavEKF3::LogLevel>", file: !32, line: 1044, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !711, templateParams: !723, identifier: "_ZTS7AP_EnumIN7NavEKF38LogLevelEE")
!711 = !{!712, !713, !719}
!712 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !710, baseType: !524, flags: DIFlagPublic, extraData: i32 0)
!713 = !DISubprogram(name: "operator const NavEKF3::LogLevel", linkageName: "_ZNK7AP_EnumIN7NavEKF38LogLevelEEcvKS1_Ev", scope: !710, file: !32, line: 1047, type: !714, scopeLine: 1047, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!719 = !DISubprogram(name: "set", linkageName: "_ZN7AP_EnumIN7NavEKF38LogLevelEE3setES1_", scope: !710, file: !32, line: 1050, type: !720, scopeLine: 1050, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !722, !41}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!723 = !{!724}
!724 = !DITemplateTypeParameter(name: "eclass", type: !41)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_gpsVAccThreshold", scope: !43, file: !42, line: 450, baseType: !557, size: 32, offset: 1728)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "gpsNEVelVarAccScale", scope: !43, file: !42, line: 458, baseType: !168, size: 32, offset: 1760)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "gpsDVelVarAccScale", scope: !43, file: !42, line: 459, baseType: !168, size: 32, offset: 1792)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "gpsPosVarAccScale", scope: !43, file: !42, line: 460, baseType: !168, size: 32, offset: 1824)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "extNavVelVarAccScale", scope: !43, file: !42, line: 461, baseType: !168, size: 32, offset: 1856)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "magDelay_ms", scope: !43, file: !42, line: 462, baseType: !66, size: 16, offset: 1888)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tasDelay_ms", scope: !43, file: !42, line: 463, baseType: !66, size: 16, offset: 1904)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tiltDriftTimeMax_ms", scope: !43, file: !42, line: 464, baseType: !66, size: 16, offset: 1920)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "posRetryTimeUseVel_ms", scope: !43, file: !42, line: 465, baseType: !66, size: 16, offset: 1936)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "posRetryTimeNoVel_ms", scope: !43, file: !42, line: 466, baseType: !66, size: 16, offset: 1952)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "hgtRetryTimeMode0_ms", scope: !43, file: !42, line: 467, baseType: !66, size: 16, offset: 1968)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "hgtRetryTimeMode12_ms", scope: !43, file: !42, line: 468, baseType: !66, size: 16, offset: 1984)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tasRetryTime_ms", scope: !43, file: !42, line: 469, baseType: !66, size: 16, offset: 2000)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dragFailTimeLimit_ms", scope: !43, file: !42, line: 470, baseType: !66, size: 16, offset: 2016)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "magFailTimeLimit_ms", scope: !43, file: !42, line: 471, baseType: !462, size: 32, offset: 2048)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "magVarRateScale", scope: !43, file: !42, line: 472, baseType: !168, size: 32, offset: 2080)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "gyroBiasNoiseScaler", scope: !43, file: !42, line: 473, baseType: !168, size: 32, offset: 2112)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "hgtAvg_ms", scope: !43, file: !42, line: 474, baseType: !66, size: 16, offset: 2144)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "betaAvg_ms", scope: !43, file: !42, line: 475, baseType: !66, size: 16, offset: 2160)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "covTimeStepMax", scope: !43, file: !42, line: 476, baseType: !168, size: 32, offset: 2176)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "covDelAngMax", scope: !43, file: !42, line: 477, baseType: !168, size: 32, offset: 2208)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "DCM33FlowMin", scope: !43, file: !42, line: 478, baseType: !168, size: 32, offset: 2240)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "fScaleFactorPnoise", scope: !43, file: !42, line: 479, baseType: !168, size: 32, offset: 2272)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flowTimeDeltaAvg_ms", scope: !43, file: !42, line: 480, baseType: !60, size: 8, offset: 2304)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "flowIntervalMax_ms", scope: !43, file: !42, line: 481, baseType: !462, size: 32, offset: 2336)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gndEffectBaroScaler", scope: !43, file: !42, line: 482, baseType: !168, size: 32, offset: 2368)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gndGradientSigma", scope: !43, file: !42, line: 483, baseType: !60, size: 8, offset: 2400)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fusionTimeStep_ms", scope: !43, file: !42, line: 484, baseType: !66, size: 16, offset: 2416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sensorIntervalMin_ms", scope: !43, file: !42, line: 485, baseType: !60, size: 8, offset: 2432)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flowIntervalMin_ms", scope: !43, file: !42, line: 486, baseType: !60, size: 8, offset: 2440)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "extNavIntervalMin_ms", scope: !43, file: !42, line: 487, baseType: !60, size: 8, offset: 2448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "maxYawEstVelInnov", scope: !43, file: !42, line: 488, baseType: !168, size: 32, offset: 2464)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "deadReckonDeclare_ms", scope: !43, file: !42, line: 489, baseType: !66, size: 16, offset: 2496)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "imuSampleTime_us", scope: !43, file: !42, line: 492, baseType: !759, size: 64, offset: 2560)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !55, line: 60, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !57, line: 105, baseType: !761)
!761 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lastLaneSwitch_ms", scope: !43, file: !42, line: 495, baseType: !112, size: 32, offset: 2624)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lastLogWrite_us", scope: !43, file: !42, line: 498, baseType: !759, size: 64, offset: 2688)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "yaw_reset_data", scope: !43, file: !42, line: 505, baseType: !765, size: 128, offset: 2752)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !43, file: !42, line: 500, size: 128, flags: DIFlagTypePassByValue, elements: !766, identifier: "_ZTSN7NavEKF3Ut_E")
!766 = !{!767, !768, !769, !770}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "last_function_call", scope: !765, file: !42, line: 501, baseType: !112, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "core_changed", scope: !765, file: !42, line: 502, baseType: !8, size: 8, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "last_primary_change", scope: !765, file: !42, line: 503, baseType: !112, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "core_delta", scope: !765, file: !42, line: 504, baseType: !117, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pos_reset_data", scope: !43, file: !42, line: 512, baseType: !772, size: 160, offset: 2880)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !43, file: !42, line: 507, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !773, identifier: "_ZTSN7NavEKF3Ut0_E")
!773 = !{!774, !775, !776, !777}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "last_function_call", scope: !772, file: !42, line: 508, baseType: !112, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "core_changed", scope: !772, file: !42, line: 509, baseType: !8, size: 8, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "last_primary_change", scope: !772, file: !42, line: 510, baseType: !112, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "core_delta", scope: !772, file: !42, line: 511, baseType: !778, size: 64, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vector2f", file: !779, line: 297, baseType: !780)
!779 = !DIFile(filename: "../../libraries/AP_Math/vector2.h", directory: "/workdisk/akul/fire/fin/ardupilot/build/Pixhawk6C")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vector2<float>", file: !779, line: 42, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !781, templateParams: !1002, identifier: "_ZTS7Vector2IfE")
!781 = !{!782, !783, !784, !788, !791, !797, !798, !801, !804, !805, !808, !809, !813, !814, !817, !818, !821, !822, !823, !824, !827, !830, !831, !832, !835, !838, !839, !840, !841, !844, !845, !846, !849, !850, !851, !854, !857, !858, !975, !978, !981, !982, !985, !986, !989, !992, !993, !996, !999}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !780, file: !779, line: 44, baseType: !117, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !780, file: !779, line: 44, baseType: !117, size: 32, offset: 32)
!784 = !DISubprogram(name: "Vector2", scope: !780, file: !779, line: 47, type: !785, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !787}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!788 = !DISubprogram(name: "Vector2", scope: !780, file: !779, line: 52, type: !789, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !787, !168, !168}
!791 = !DISubprogram(name: "operator==", linkageName: "_ZNK7Vector2IfEeqERKS0_", scope: !780, file: !779, line: 57, type: !792, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!792 = !DISubroutineType(types: !793)
!793 = !{!8, !794, !796}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!796 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !795, size: 32)
!797 = !DISubprogram(name: "operator!=", linkageName: "_ZNK7Vector2IfEneERKS0_", scope: !780, file: !779, line: 60, type: !792, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!798 = !DISubprogram(name: "operator-", linkageName: "_ZNK7Vector2IfEngEv", scope: !780, file: !779, line: 63, type: !799, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!799 = !DISubroutineType(types: !800)
!800 = !{!780, !794}
!801 = !DISubprogram(name: "operator+", linkageName: "_ZNK7Vector2IfEplERKS0_", scope: !780, file: !779, line: 66, type: !802, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!802 = !DISubroutineType(types: !803)
!803 = !{!780, !794, !796}
!804 = !DISubprogram(name: "operator-", linkageName: "_ZNK7Vector2IfEmiERKS0_", scope: !780, file: !779, line: 69, type: !802, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!805 = !DISubprogram(name: "operator*", linkageName: "_ZNK7Vector2IfEmlEf", scope: !780, file: !779, line: 72, type: !806, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!806 = !DISubroutineType(types: !807)
!807 = !{!780, !794, !168}
!808 = !DISubprogram(name: "operator/", linkageName: "_ZNK7Vector2IfEdvEf", scope: !780, file: !779, line: 75, type: !806, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!809 = !DISubprogram(name: "operator+=", linkageName: "_ZN7Vector2IfEpLERKS0_", scope: !780, file: !779, line: 78, type: !810, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!810 = !DISubroutineType(types: !811)
!811 = !{!812, !787, !796}
!812 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !780, size: 32)
!813 = !DISubprogram(name: "operator-=", linkageName: "_ZN7Vector2IfEmIERKS0_", scope: !780, file: !779, line: 81, type: !810, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!814 = !DISubprogram(name: "operator*=", linkageName: "_ZN7Vector2IfEmLEf", scope: !780, file: !779, line: 84, type: !815, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!815 = !DISubroutineType(types: !816)
!816 = !{!812, !787, !168}
!817 = !DISubprogram(name: "operator/=", linkageName: "_ZN7Vector2IfEdVEf", scope: !780, file: !779, line: 87, type: !815, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!818 = !DISubprogram(name: "operator*", linkageName: "_ZNK7Vector2IfEmlERKS0_", scope: !780, file: !779, line: 90, type: !819, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!819 = !DISubroutineType(types: !820)
!820 = !{!117, !794, !796}
!821 = !DISubprogram(name: "dot", linkageName: "_ZNK7Vector2IfE3dotERKS0_", scope: !780, file: !779, line: 93, type: !819, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!822 = !DISubprogram(name: "operator%", linkageName: "_ZNK7Vector2IfErmERKS0_", scope: !780, file: !779, line: 98, type: !819, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!823 = !DISubprogram(name: "angle", linkageName: "_ZNK7Vector2IfE5angleERKS0_", scope: !780, file: !779, line: 102, type: !819, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!824 = !DISubprogram(name: "angle", linkageName: "_ZNK7Vector2IfE5angleEv", scope: !780, file: !779, line: 106, type: !825, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!825 = !DISubroutineType(types: !826)
!826 = !{!117, !794}
!827 = !DISubprogram(name: "is_nan", linkageName: "_ZNK7Vector2IfE6is_nanEv", scope: !780, file: !779, line: 109, type: !828, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!828 = !DISubroutineType(types: !829)
!829 = !{!8, !794}
!830 = !DISubprogram(name: "is_inf", linkageName: "_ZNK7Vector2IfE6is_infEv", scope: !780, file: !779, line: 112, type: !828, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!831 = !DISubprogram(name: "is_zero", linkageName: "_ZNK7Vector2IfE7is_zeroEv", scope: !780, file: !779, line: 285, type: !828, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!832 = !DISubprogram(name: "operator[]", linkageName: "_ZN7Vector2IfEixEh", scope: !780, file: !779, line: 120, type: !833, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DISubroutineType(types: !834)
!834 = !{!246, !787, !61}
!835 = !DISubprogram(name: "operator[]", linkageName: "_ZNK7Vector2IfEixEh", scope: !780, file: !779, line: 128, type: !836, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!836 = !DISubroutineType(types: !837)
!837 = !{!566, !794, !61}
!838 = !DISubprogram(name: "zero", linkageName: "_ZN7Vector2IfE4zeroEv", scope: !780, file: !779, line: 137, type: !785, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!839 = !DISubprogram(name: "length_squared", linkageName: "_ZNK7Vector2IfE14length_squaredEv", scope: !780, file: !779, line: 143, type: !825, scopeLine: 143, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!840 = !DISubprogram(name: "length", linkageName: "_ZNK7Vector2IfE6lengthEv", scope: !780, file: !779, line: 146, type: !825, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!841 = !DISubprogram(name: "limit_length", linkageName: "_ZN7Vector2IfE12limit_lengthEf", scope: !780, file: !779, line: 149, type: !842, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!842 = !DISubroutineType(types: !843)
!843 = !{!8, !787, !117}
!844 = !DISubprogram(name: "normalize", linkageName: "_ZN7Vector2IfE9normalizeEv", scope: !780, file: !779, line: 152, type: !785, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!845 = !DISubprogram(name: "normalized", linkageName: "_ZNK7Vector2IfE10normalizedEv", scope: !780, file: !779, line: 155, type: !799, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!846 = !DISubprogram(name: "reflect", linkageName: "_ZN7Vector2IfE7reflectERKS0_", scope: !780, file: !779, line: 158, type: !847, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !787, !796}
!849 = !DISubprogram(name: "project", linkageName: "_ZN7Vector2IfE7projectERKS0_", scope: !780, file: !779, line: 161, type: !847, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
